/* automatically generated by rust-bindgen 0.55.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage, Align> {
    storage: Storage,
    align: [Align; 0],
}
impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage, align: [] }
    }
}
impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]

pub const BX_MAXCONTRAST: u32 = 4;
pub const BX_NODITHER: u32 = 8;
pub const BX_GRAYSCALE: u32 = 16;
pub const BX_TXFILE: u32 = 32;
pub const BX_DOTRANSFER: u32 = 256;
pub const SV_NOREPLACE: u32 = 1;
pub const SV_MAKEPATH: u32 = 2;
pub const BAD_FILENAME: i32 = -2222;
pub const BAD_ARGUMENT: i32 = -2223;
pub const KEYINPUT_EVENT: u32 = 1;
pub const MOUSE_INPUT_EVENT: u32 = 4;
pub const MOUSE_MOTION_INPUT_EVENT: u32 = 5;
pub const MOUSE_BUTTON_INPUT_EVENT: u32 = 6;
pub const ELKMOD_NONE: u32 = 0;
pub const ELKMOD_LSHIFT: u32 = 1;
pub const ELKMOD_RSHIFT: u32 = 2;
pub const ELKMOD_LCTRL: u32 = 64;
pub const ELKMOD_RCTRL: u32 = 128;
pub const ELKMOD_LALT: u32 = 256;
pub const ELKMOD_RALT: u32 = 512;
pub const ELKMOD_LMETA: u32 = 1024;
pub const ELKMOD_RMETA: u32 = 2048;
pub const ELKMOD_NUM: u32 = 4096;
pub const ELKMOD_CAPS: u32 = 8192;
pub const ELKMOD_MODE: u32 = 16384;
pub const ELKEY_DOWN: u32 = 1;
pub const ELKEY_UP: u32 = 0;
pub const FIVE_SAMPLE_MODEL: u32 = 1;
pub const NINE_SAMPLE_MODEL: u32 = 2;
pub const SEVENTEEN_SAMPLE_MODEL: u32 = 3;
pub const EL1000_TRACKER_MODEL: u32 = 4;
pub const CR_HAIR_COLOR: u32 = 1;
pub const PUPIL_HAIR_COLOR: u32 = 2;
pub const PUPIL_BOX_COLOR: u32 = 3;
pub const SEARCH_LIMIT_BOX_COLOR: u32 = 4;
pub const MOUSE_CURSOR_COLOR: u32 = 5;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type ssize_t = __ssize_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type size_t = ::std::os::raw::c_ulong;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sigset_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_usec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_nsec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fd_set>())).__fds_bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(__fds_bits)
        )
    );
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
impl Default for __pthread_internal_list {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[test]
fn bindgen_test_layout___pthread_internal_slist() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_slist>())).__next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_slist),
            "::",
            stringify!(__next)
        )
    );
}
impl Default for __pthread_internal_slist {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__lock as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__count as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__owner as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__nusers as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__kind as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__spins as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__elision as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__elision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__list as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
impl Default for __pthread_mutex_s {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_rwlock_arch_t>(),
        56usize,
        concat!("Size of: ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_rwlock_arch_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__readers as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__readers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__writers as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__wrphase_futex as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__wrphase_futex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__writers_futex as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers_futex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad3 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad4 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__cur_writer as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__cur_writer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__shared as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__shared)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__rwelision as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__rwelision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad1 as *const _ as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad2 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__flags as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__flags)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __bindgen_anon_1: __pthread_cond_s__bindgen_ty_1,
    pub __bindgen_anon_2: __pthread_cond_s__bindgen_ty_2,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_1 {
    pub __wseq: ::std::os::raw::c_ulonglong,
    pub __wseq32: __pthread_cond_s__bindgen_ty_1__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq32 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq32)
        )
    );
}
impl Default for __pthread_cond_s__bindgen_ty_1 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_2 {
    pub __g1_start: ::std::os::raw::c_ulonglong,
    pub __g1_start32: __pthread_cond_s__bindgen_ty_2__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start32 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start32)
        )
    );
}
impl Default for __pthread_cond_s__bindgen_ty_2 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_refs as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_refs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g1_orig_size as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_orig_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__wrefs as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wrefs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_signals as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_signals)
        )
    );
}
impl Default for __pthread_cond_s {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_mutexattr_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_condattr_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_attr_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 5usize],
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_mutex_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
    _bindgen_union_align: [u64; 6usize],
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_cond_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_rwlock_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_rwlockattr_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 4usize],
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_barrier_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_barrierattr_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wch as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wch)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wchb as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wchb)
        )
    );
}
impl Default for __mbstate_t__bindgen_ty_1 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__value as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__value)
        )
    );
}
impl Default for __mbstate_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    assert_eq!(
        ::std::mem::size_of::<_G_fpos_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos_t>())).__pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos_t>())).__state as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__state)
        )
    );
}
impl Default for _G_fpos_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    assert_eq!(
        ::std::mem::size_of::<_G_fpos64_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos64_t>())).__pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos64_t>())).__state as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__state)
        )
    );
}
impl Default for _G_fpos64_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: size_t,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    assert_eq!(
        ::std::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_ptr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_end as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_base as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_base as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_ptr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_end as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_base as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_end as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_base as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_backup_base as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_end as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._markers as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._chain as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._fileno as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags2 as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._old_offset as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._cur_column as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._vtable_offset as *const _ as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._shortbuf as *const _ as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._lock as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._offset as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._codecvt as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_codecvt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._wide_data as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_wide_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._freeres_list as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_list)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._freeres_buf as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad5 as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._mode as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._unused2 as *const _ as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
impl Default for _IO_FILE {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type fpos_t = __fpos_t;
extern "C" {
    pub static mut stdin: *mut FILE;
}
extern "C" {
    pub static mut stdout: *mut FILE;
}
extern "C" {
    pub static mut stderr: *mut FILE;
}
extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renameat(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __pfx: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int, __modes: *const ::std::os::raw::c_char)
        -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(
        __s: *mut ::std::os::raw::c_void,
        __len: size_t,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::std::os::raw::c_char,
        __sizeloc: *mut size_t,
    ) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char, __size: size_t);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut size_t,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut size_t,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut size_t,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __s: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::std::os::raw::c_void,
        __size: size_t,
        __n: size_t,
        __stream: *mut FILE,
    ) -> size_t;
}
extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::std::os::raw::c_void,
        __size: size_t,
        __n: size_t,
        __stream: *mut FILE,
    ) -> size_t;
}
extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::std::os::raw::c_long,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
extern "C" {
    pub static mut sys_nerr: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut sys_errlist: [*const ::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn popen(
        __command: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn __uflow(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
pub type wchar_t = ::std::os::raw::c_int;
pub const idtype_t_P_ALL: idtype_t = 0;
pub const idtype_t_P_PID: idtype_t = 1;
pub const idtype_t_P_PGID: idtype_t = 2;
pub type idtype_t = ::std::os::raw::c_uint;
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
    assert_eq!(
        ::std::mem::size_of::<div_t>(),
        8usize,
        concat!("Size of: ", stringify!(div_t))
    );
    assert_eq!(
        ::std::mem::align_of::<div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(div_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<div_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<div_t>())).rem as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
    assert_eq!(
        ::std::mem::size_of::<ldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(ldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ldiv_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ldiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ldiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
    assert_eq!(
        ::std::mem::size_of::<lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(lldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lldiv_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lldiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lldiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn __ctype_get_mb_cur_max() -> size_t;
}
extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atol(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn atoll(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn l64a(__n: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn a64l(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srandom(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn initstate(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: size_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn setstate(__statebuf: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[test]
fn bindgen_test_layout_random_data() {
    assert_eq!(
        ::std::mem::size_of::<random_data>(),
        48usize,
        concat!("Size of: ", stringify!(random_data))
    );
    assert_eq!(
        ::std::mem::align_of::<random_data>(),
        8usize,
        concat!("Alignment of ", stringify!(random_data))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).fptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(fptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).rptr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).state as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).rand_type as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).rand_deg as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_deg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).rand_sep as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_sep)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).end_ptr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(end_ptr)
        )
    );
}
impl Default for random_data {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srandom_r(
        __seed: ::std::os::raw::c_uint,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn initstate_r(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: size_t,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setstate_r(
        __statebuf: *mut ::std::os::raw::c_char,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn drand48() -> f64;
}
extern "C" {
    pub fn erand48(__xsubi: *mut ::std::os::raw::c_ushort) -> f64;
}
extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn nrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn jrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srand48(__seedval: ::std::os::raw::c_long);
}
extern "C" {
    pub fn seed48(__seed16v: *mut ::std::os::raw::c_ushort) -> *mut ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn lcong48(__param: *mut ::std::os::raw::c_ushort);
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_drand48_data() {
    assert_eq!(
        ::std::mem::size_of::<drand48_data>(),
        24usize,
        concat!("Size of: ", stringify!(drand48_data))
    );
    assert_eq!(
        ::std::mem::align_of::<drand48_data>(),
        8usize,
        concat!("Alignment of ", stringify!(drand48_data))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__old_x as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__old_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__c as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__init as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__init)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__a as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__a)
        )
    );
}
extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn erand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn jrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand48_r(
        __seedval: ::std::os::raw::c_long,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn seed48_r(
        __seed16v: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lcong48_r(
        __param: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn malloc(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn calloc(
        __nmemb: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn realloc(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn reallocarray(
        __ptr: *mut ::std::os::raw::c_void,
        __nmemb: size_t,
        __size: size_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn free(__ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn alloca(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn valloc(__size: size_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut ::std::os::raw::c_void,
        __alignment: size_t,
        __size: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aligned_alloc(__alignment: size_t, __size: size_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn abort();
}
extern "C" {
    pub fn atexit(__func: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn at_quick_exit(
        __func: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn on_exit(
        __func: ::std::option::Option<
            unsafe extern "C" fn(
                __status: ::std::os::raw::c_int,
                __arg: *mut ::std::os::raw::c_void,
            ),
        >,
        __arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn quick_exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn _Exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn getenv(__name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn putenv(__string: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setenv(
        __name: *const ::std::os::raw::c_char,
        __value: *const ::std::os::raw::c_char,
        __replace: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unsetenv(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearenv() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mktemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn mkstemp(__template: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemps(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkdtemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn system(__command: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn realpath(
        __name: *const ::std::os::raw::c_char,
        __resolved: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type __compar_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn bsearch(
        __key: *const ::std::os::raw::c_void,
        __base: *const ::std::os::raw::c_void,
        __nmemb: size_t,
        __size: size_t,
        __compar: __compar_fn_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn qsort(
        __base: *mut ::std::os::raw::c_void,
        __nmemb: size_t,
        __size: size_t,
        __compar: __compar_fn_t,
    );
}
extern "C" {
    pub fn abs(__x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn labs(__x: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llabs(__x: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn div(__numer: ::std::os::raw::c_int, __denom: ::std::os::raw::c_int) -> div_t;
}
extern "C" {
    pub fn ldiv(__numer: ::std::os::raw::c_long, __denom: ::std::os::raw::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(
        __numer: ::std::os::raw::c_longlong,
        __denom: ::std::os::raw::c_longlong,
    ) -> lldiv_t;
}
extern "C" {
    pub fn mblen(__s: *const ::std::os::raw::c_char, __n: size_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbtowc(
        __pwc: *mut wchar_t,
        __s: *const ::std::os::raw::c_char,
        __n: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wctomb(__s: *mut ::std::os::raw::c_char, __wchar: wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbstowcs(
        __pwcs: *mut wchar_t,
        __s: *const ::std::os::raw::c_char,
        __n: size_t,
    ) -> size_t;
}
extern "C" {
    pub fn wcstombs(
        __s: *mut ::std::os::raw::c_char,
        __pwcs: *const wchar_t,
        __n: size_t,
    ) -> size_t;
}
extern "C" {
    pub fn rpmatch(__response: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsubopt(
        __optionp: *mut *mut ::std::os::raw::c_char,
        __tokens: *const *mut ::std::os::raw::c_char,
        __valuep: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Default, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
extern "C" {
    pub fn memcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memmove(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memccpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memset(
        __s: *mut ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memchr(
        __s: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    assert_eq!(
        ::std::mem::size_of::<__locale_struct>(),
        232usize,
        concat!("Size of: ", stringify!(__locale_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<__locale_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(__locale_struct))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__locales as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__locales)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_b as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_tolower as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_tolower)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_toupper as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_toupper)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__names as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__names)
        )
    );
}
impl Default for __locale_struct {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn __strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn bcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bcopy(
        __src: *const ::std::os::raw::c_void,
        __dest: *mut ::std::os::raw::c_void,
        __n: size_t,
    );
}
extern "C" {
    pub fn bzero(__s: *mut ::std::os::raw::c_void, __n: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn index(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn rindex(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ffs(__i: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ffsl(__l: ::std::os::raw::c_long) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ffsll(__ll: ::std::os::raw::c_longlong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn explicit_bzero(__s: *mut ::std::os::raw::c_void, __n: size_t);
}
extern "C" {
    pub fn __stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: size_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type __gwchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_imaxdiv_t() {
    assert_eq!(
        ::std::mem::size_of::<imaxdiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<imaxdiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imaxdiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imaxdiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn imaxabs(__n: intmax_t) -> intmax_t;
}
extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denom: intmax_t) -> imaxdiv_t;
}
extern "C" {
    pub fn wcstoimax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn wcstoumax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
pub const _ISupper: ::std::os::raw::c_uint = 256;
pub const _ISlower: ::std::os::raw::c_uint = 512;
pub const _ISalpha: ::std::os::raw::c_uint = 1024;
pub const _ISdigit: ::std::os::raw::c_uint = 2048;
pub const _ISxdigit: ::std::os::raw::c_uint = 4096;
pub const _ISspace: ::std::os::raw::c_uint = 8192;
pub const _ISprint: ::std::os::raw::c_uint = 16384;
pub const _ISgraph: ::std::os::raw::c_uint = 32768;
pub const _ISblank: ::std::os::raw::c_uint = 1;
pub const _IScntrl: ::std::os::raw::c_uint = 2;
pub const _ISpunct: ::std::os::raw::c_uint = 4;
pub const _ISalnum: ::std::os::raw::c_uint = 8;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
extern "C" {
    pub fn __ctype_b_loc() -> *mut *const ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn __ctype_tolower_loc() -> *mut *const __int32_t;
}
extern "C" {
    pub fn __ctype_toupper_loc() -> *mut *const __int32_t;
}
extern "C" {
    pub fn isalnum(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isalpha(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iscntrl(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isdigit(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn islower(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isgraph(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isprint(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ispunct(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isspace(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isupper(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isxdigit(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tolower(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn toupper(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isblank(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isascii(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn toascii(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _toupper(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _tolower(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isalnum_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isalpha_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iscntrl_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isdigit_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn islower_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isgraph_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isprint_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ispunct_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isspace_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isupper_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isxdigit_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isblank_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __tolower_l(__c: ::std::os::raw::c_int, __l: locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tolower_l(__c: ::std::os::raw::c_int, __l: locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __toupper_l(__c: ::std::os::raw::c_int, __l: locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn toupper_l(__c: ::std::os::raw::c_int, __l: locale_t) -> ::std::os::raw::c_int;
}
pub type iconv_t = *mut ::std::os::raw::c_void;
extern "C" {
    pub fn iconv_open(
        __tocode: *const ::std::os::raw::c_char,
        __fromcode: *const ::std::os::raw::c_char,
    ) -> iconv_t;
}
extern "C" {
    pub fn iconv(
        __cd: iconv_t,
        __inbuf: *mut *mut ::std::os::raw::c_char,
        __inbytesleft: *mut size_t,
        __outbuf: *mut *mut ::std::os::raw::c_char,
        __outbytesleft: *mut size_t,
    ) -> size_t;
}
extern "C" {
    pub fn iconv_close(__cd: iconv_t) -> ::std::os::raw::c_int;
}
pub const SDL_bool_SDL_FALSE: SDL_bool = 0;
pub const SDL_bool_SDL_TRUE: SDL_bool = 1;
pub type SDL_bool = ::std::os::raw::c_uint;
pub type Sint8 = i8;
pub type Uint8 = u8;
pub type Sint16 = i16;
pub type Uint16 = u16;
pub type Sint32 = i32;
pub type Uint32 = u32;
pub type Sint64 = i64;
pub type Uint64 = u64;
pub type SDL_dummy_uint8 = [::std::os::raw::c_int; 1usize];
pub type SDL_dummy_sint8 = [::std::os::raw::c_int; 1usize];
pub type SDL_dummy_uint16 = [::std::os::raw::c_int; 1usize];
pub type SDL_dummy_sint16 = [::std::os::raw::c_int; 1usize];
pub type SDL_dummy_uint32 = [::std::os::raw::c_int; 1usize];
pub type SDL_dummy_sint32 = [::std::os::raw::c_int; 1usize];
pub type SDL_dummy_uint64 = [::std::os::raw::c_int; 1usize];
pub type SDL_dummy_sint64 = [::std::os::raw::c_int; 1usize];
pub const SDL_DUMMY_ENUM_DUMMY_ENUM_VALUE: SDL_DUMMY_ENUM = 0;
pub type SDL_DUMMY_ENUM = ::std::os::raw::c_uint;
pub type SDL_dummy_enum = [::std::os::raw::c_int; 1usize];
extern "C" {
    pub fn SDL_revcpy(
        dst: *mut ::std::os::raw::c_void,
        src: *const ::std::os::raw::c_void,
        len: size_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn SDL_strlcpy(
        dst: *mut ::std::os::raw::c_char,
        src: *const ::std::os::raw::c_char,
        maxlen: size_t,
    ) -> size_t;
}
extern "C" {
    pub fn SDL_strlcat(
        dst: *mut ::std::os::raw::c_char,
        src: *const ::std::os::raw::c_char,
        maxlen: size_t,
    ) -> size_t;
}
extern "C" {
    pub fn SDL_strrev(string: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn SDL_strupr(string: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn SDL_strlwr(string: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn SDL_ltoa(
        value: ::std::os::raw::c_long,
        string: *mut ::std::os::raw::c_char,
        radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn SDL_ultoa(
        value: ::std::os::raw::c_ulong,
        string: *mut ::std::os::raw::c_char,
        radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn SDL_lltoa(
        value: Sint64,
        string: *mut ::std::os::raw::c_char,
        radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn SDL_ulltoa(
        value: Uint64,
        string: *mut ::std::os::raw::c_char,
        radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn SDL_iconv(
        cd: iconv_t,
        inbuf: *mut *const ::std::os::raw::c_char,
        inbytesleft: *mut size_t,
        outbuf: *mut *mut ::std::os::raw::c_char,
        outbytesleft: *mut size_t,
    ) -> size_t;
}
extern "C" {
    pub fn SDL_iconv_string(
        tocode: *const ::std::os::raw::c_char,
        fromcode: *const ::std::os::raw::c_char,
        inbuf: *const ::std::os::raw::c_char,
        inbytesleft: size_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn SDL_SetError(fmt: *const ::std::os::raw::c_char, ...);
}
extern "C" {
    pub fn SDL_GetError() -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn SDL_ClearError();
}
pub const SDL_errorcode_SDL_ENOMEM: SDL_errorcode = 0;
pub const SDL_errorcode_SDL_EFREAD: SDL_errorcode = 1;
pub const SDL_errorcode_SDL_EFWRITE: SDL_errorcode = 2;
pub const SDL_errorcode_SDL_EFSEEK: SDL_errorcode = 3;
pub const SDL_errorcode_SDL_UNSUPPORTED: SDL_errorcode = 4;
pub const SDL_errorcode_SDL_LASTERROR: SDL_errorcode = 5;
pub type SDL_errorcode = ::std::os::raw::c_uint;
extern "C" {
    pub fn SDL_Error(code: SDL_errorcode);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_mutex {
    _unused: [u8; 0],
}
extern "C" {
    pub fn SDL_CreateMutex() -> *mut SDL_mutex;
}
extern "C" {
    pub fn SDL_mutexP(mutex: *mut SDL_mutex) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_mutexV(mutex: *mut SDL_mutex) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_DestroyMutex(mutex: *mut SDL_mutex);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_semaphore {
    _unused: [u8; 0],
}
pub type SDL_sem = SDL_semaphore;
extern "C" {
    pub fn SDL_CreateSemaphore(initial_value: Uint32) -> *mut SDL_sem;
}
extern "C" {
    pub fn SDL_DestroySemaphore(sem: *mut SDL_sem);
}
extern "C" {
    pub fn SDL_SemWait(sem: *mut SDL_sem) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_SemTryWait(sem: *mut SDL_sem) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_SemWaitTimeout(sem: *mut SDL_sem, ms: Uint32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_SemPost(sem: *mut SDL_sem) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_SemValue(sem: *mut SDL_sem) -> Uint32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_cond {
    _unused: [u8; 0],
}
extern "C" {
    pub fn SDL_CreateCond() -> *mut SDL_cond;
}
extern "C" {
    pub fn SDL_DestroyCond(cond: *mut SDL_cond);
}
extern "C" {
    pub fn SDL_CondSignal(cond: *mut SDL_cond) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_CondBroadcast(cond: *mut SDL_cond) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_CondWait(cond: *mut SDL_cond, mut_: *mut SDL_mutex) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_CondWaitTimeout(
        cond: *mut SDL_cond,
        mutex: *mut SDL_mutex,
        ms: Uint32,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_Thread {
    _unused: [u8; 0],
}
extern "C" {
    pub fn SDL_CreateThread(
        fn_: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
        >,
        data: *mut ::std::os::raw::c_void,
    ) -> *mut SDL_Thread;
}
extern "C" {
    pub fn SDL_ThreadID() -> Uint32;
}
extern "C" {
    pub fn SDL_GetThreadID(thread: *mut SDL_Thread) -> Uint32;
}
extern "C" {
    pub fn SDL_WaitThread(thread: *mut SDL_Thread, status: *mut ::std::os::raw::c_int);
}
extern "C" {
    pub fn SDL_KillThread(thread: *mut SDL_Thread);
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_RWops {
    pub seek: ::std::option::Option<
        unsafe extern "C" fn(
            context: *mut SDL_RWops,
            offset: ::std::os::raw::c_int,
            whence: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub read: ::std::option::Option<
        unsafe extern "C" fn(
            context: *mut SDL_RWops,
            ptr: *mut ::std::os::raw::c_void,
            size: ::std::os::raw::c_int,
            maxnum: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub write: ::std::option::Option<
        unsafe extern "C" fn(
            context: *mut SDL_RWops,
            ptr: *const ::std::os::raw::c_void,
            size: ::std::os::raw::c_int,
            num: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub close: ::std::option::Option<
        unsafe extern "C" fn(context: *mut SDL_RWops) -> ::std::os::raw::c_int,
    >,
    pub type_: Uint32,
    pub hidden: SDL_RWops__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union SDL_RWops__bindgen_ty_1 {
    pub stdio: SDL_RWops__bindgen_ty_1__bindgen_ty_1,
    pub mem: SDL_RWops__bindgen_ty_1__bindgen_ty_2,
    pub unknown: SDL_RWops__bindgen_ty_1__bindgen_ty_3,
    _bindgen_union_align: [u64; 3usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_RWops__bindgen_ty_1__bindgen_ty_1 {
    pub autoclose: ::std::os::raw::c_int,
    pub fp: *mut FILE,
}
#[test]
fn bindgen_test_layout_SDL_RWops__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SDL_RWops__bindgen_ty_1__bindgen_ty_1>())).autoclose as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(autoclose)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SDL_RWops__bindgen_ty_1__bindgen_ty_1>())).fp as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(fp)
        )
    );
}
impl Default for SDL_RWops__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_RWops__bindgen_ty_1__bindgen_ty_2 {
    pub base: *mut Uint8,
    pub here: *mut Uint8,
    pub stop: *mut Uint8,
}
#[test]
fn bindgen_test_layout_SDL_RWops__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_2>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SDL_RWops__bindgen_ty_1__bindgen_ty_2>())).base as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SDL_RWops__bindgen_ty_1__bindgen_ty_2>())).here as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(here)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SDL_RWops__bindgen_ty_1__bindgen_ty_2>())).stop as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(stop)
        )
    );
}
impl Default for SDL_RWops__bindgen_ty_1__bindgen_ty_2 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_RWops__bindgen_ty_1__bindgen_ty_3 {
    pub data1: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_SDL_RWops__bindgen_ty_1__bindgen_ty_3() {
    assert_eq!(
        ::std::mem::size_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_3>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_3>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SDL_RWops__bindgen_ty_1__bindgen_ty_3>())).data1 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(data1)
        )
    );
}
impl Default for SDL_RWops__bindgen_ty_1__bindgen_ty_3 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[test]
fn bindgen_test_layout_SDL_RWops__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<SDL_RWops__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(SDL_RWops__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_RWops__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_RWops__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_RWops__bindgen_ty_1>())).stdio as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1),
            "::",
            stringify!(stdio)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_RWops__bindgen_ty_1>())).mem as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1),
            "::",
            stringify!(mem)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_RWops__bindgen_ty_1>())).unknown as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1),
            "::",
            stringify!(unknown)
        )
    );
}
impl Default for SDL_RWops__bindgen_ty_1 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[test]
fn bindgen_test_layout_SDL_RWops() {
    assert_eq!(
        ::std::mem::size_of::<SDL_RWops>(),
        64usize,
        concat!("Size of: ", stringify!(SDL_RWops))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_RWops>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_RWops))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_RWops>())).seek as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(seek)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_RWops>())).read as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_RWops>())).write as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(write)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_RWops>())).close as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(close)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_RWops>())).type_ as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_RWops>())).hidden as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(hidden)
        )
    );
}
impl Default for SDL_RWops {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub fn SDL_RWFromFile(
        file: *const ::std::os::raw::c_char,
        mode: *const ::std::os::raw::c_char,
    ) -> *mut SDL_RWops;
}
extern "C" {
    pub fn SDL_RWFromFP(fp: *mut FILE, autoclose: ::std::os::raw::c_int) -> *mut SDL_RWops;
}
extern "C" {
    pub fn SDL_RWFromMem(
        mem: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
    ) -> *mut SDL_RWops;
}
extern "C" {
    pub fn SDL_RWFromConstMem(
        mem: *const ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
    ) -> *mut SDL_RWops;
}
extern "C" {
    pub fn SDL_AllocRW() -> *mut SDL_RWops;
}
extern "C" {
    pub fn SDL_FreeRW(area: *mut SDL_RWops);
}
extern "C" {
    pub fn SDL_ReadLE16(src: *mut SDL_RWops) -> Uint16;
}
extern "C" {
    pub fn SDL_ReadBE16(src: *mut SDL_RWops) -> Uint16;
}
extern "C" {
    pub fn SDL_ReadLE32(src: *mut SDL_RWops) -> Uint32;
}
extern "C" {
    pub fn SDL_ReadBE32(src: *mut SDL_RWops) -> Uint32;
}
extern "C" {
    pub fn SDL_ReadLE64(src: *mut SDL_RWops) -> Uint64;
}
extern "C" {
    pub fn SDL_ReadBE64(src: *mut SDL_RWops) -> Uint64;
}
extern "C" {
    pub fn SDL_WriteLE16(dst: *mut SDL_RWops, value: Uint16) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_WriteBE16(dst: *mut SDL_RWops, value: Uint16) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_WriteLE32(dst: *mut SDL_RWops, value: Uint32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_WriteBE32(dst: *mut SDL_RWops, value: Uint32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_WriteLE64(dst: *mut SDL_RWops, value: Uint64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_WriteBE64(dst: *mut SDL_RWops, value: Uint64) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_AudioSpec {
    pub freq: ::std::os::raw::c_int,
    pub format: Uint16,
    pub channels: Uint8,
    pub silence: Uint8,
    pub samples: Uint16,
    pub padding: Uint16,
    pub size: Uint32,
    pub callback: ::std::option::Option<
        unsafe extern "C" fn(
            userdata: *mut ::std::os::raw::c_void,
            stream: *mut Uint8,
            len: ::std::os::raw::c_int,
        ),
    >,
    pub userdata: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_SDL_AudioSpec() {
    assert_eq!(
        ::std::mem::size_of::<SDL_AudioSpec>(),
        32usize,
        concat!("Size of: ", stringify!(SDL_AudioSpec))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_AudioSpec>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_AudioSpec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioSpec>())).freq as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(freq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioSpec>())).format as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioSpec>())).channels as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioSpec>())).silence as *const _ as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(silence)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioSpec>())).samples as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(samples)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioSpec>())).padding as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(padding)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioSpec>())).size as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioSpec>())).callback as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(callback)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioSpec>())).userdata as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(userdata)
        )
    );
}
impl Default for SDL_AudioSpec {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_AudioCVT {
    pub needed: ::std::os::raw::c_int,
    pub src_format: Uint16,
    pub dst_format: Uint16,
    pub rate_incr: f64,
    pub buf: *mut Uint8,
    pub len: ::std::os::raw::c_int,
    pub len_cvt: ::std::os::raw::c_int,
    pub len_mult: ::std::os::raw::c_int,
    pub len_ratio: f64,
    pub filters: [::std::option::Option<
        unsafe extern "C" fn(cvt: *mut SDL_AudioCVT, format: Uint16),
    >; 10usize],
    pub filter_index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_SDL_AudioCVT() {
    assert_eq!(
        ::std::mem::size_of::<SDL_AudioCVT>(),
        136usize,
        concat!("Size of: ", stringify!(SDL_AudioCVT))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_AudioCVT>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_AudioCVT))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioCVT>())).needed as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(needed)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioCVT>())).src_format as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(src_format)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioCVT>())).dst_format as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(dst_format)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioCVT>())).rate_incr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(rate_incr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioCVT>())).buf as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioCVT>())).len as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioCVT>())).len_cvt as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(len_cvt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioCVT>())).len_mult as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(len_mult)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioCVT>())).len_ratio as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(len_ratio)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioCVT>())).filters as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(filters)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioCVT>())).filter_index as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(filter_index)
        )
    );
}
impl Default for SDL_AudioCVT {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub fn SDL_AudioInit(driver_name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_AudioQuit();
}
extern "C" {
    pub fn SDL_AudioDriverName(
        namebuf: *mut ::std::os::raw::c_char,
        maxlen: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn SDL_OpenAudio(
        desired: *mut SDL_AudioSpec,
        obtained: *mut SDL_AudioSpec,
    ) -> ::std::os::raw::c_int;
}
pub const SDL_audiostatus_SDL_AUDIO_STOPPED: SDL_audiostatus = 0;
pub const SDL_audiostatus_SDL_AUDIO_PLAYING: SDL_audiostatus = 1;
pub const SDL_audiostatus_SDL_AUDIO_PAUSED: SDL_audiostatus = 2;
pub type SDL_audiostatus = ::std::os::raw::c_uint;
extern "C" {
    pub fn SDL_GetAudioStatus() -> SDL_audiostatus;
}
extern "C" {
    pub fn SDL_PauseAudio(pause_on: ::std::os::raw::c_int);
}
extern "C" {
    pub fn SDL_LoadWAV_RW(
        src: *mut SDL_RWops,
        freesrc: ::std::os::raw::c_int,
        spec: *mut SDL_AudioSpec,
        audio_buf: *mut *mut Uint8,
        audio_len: *mut Uint32,
    ) -> *mut SDL_AudioSpec;
}
extern "C" {
    pub fn SDL_FreeWAV(audio_buf: *mut Uint8);
}
extern "C" {
    pub fn SDL_BuildAudioCVT(
        cvt: *mut SDL_AudioCVT,
        src_format: Uint16,
        src_channels: Uint8,
        src_rate: ::std::os::raw::c_int,
        dst_format: Uint16,
        dst_channels: Uint8,
        dst_rate: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_ConvertAudio(cvt: *mut SDL_AudioCVT) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_MixAudio(
        dst: *mut Uint8,
        src: *const Uint8,
        len: Uint32,
        volume: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn SDL_LockAudio();
}
extern "C" {
    pub fn SDL_UnlockAudio();
}
extern "C" {
    pub fn SDL_CloseAudio();
}
pub const CDstatus_CD_TRAYEMPTY: CDstatus = 0;
pub const CDstatus_CD_STOPPED: CDstatus = 1;
pub const CDstatus_CD_PLAYING: CDstatus = 2;
pub const CDstatus_CD_PAUSED: CDstatus = 3;
pub const CDstatus_CD_ERROR: CDstatus = -1;
pub type CDstatus = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SDL_CDtrack {
    pub id: Uint8,
    pub type_: Uint8,
    pub unused: Uint16,
    pub length: Uint32,
    pub offset: Uint32,
}
#[test]
fn bindgen_test_layout_SDL_CDtrack() {
    assert_eq!(
        ::std::mem::size_of::<SDL_CDtrack>(),
        12usize,
        concat!("Size of: ", stringify!(SDL_CDtrack))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_CDtrack>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_CDtrack))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_CDtrack>())).id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_CDtrack),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_CDtrack>())).type_ as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_CDtrack),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_CDtrack>())).unused as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_CDtrack),
            "::",
            stringify!(unused)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_CDtrack>())).length as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_CDtrack),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_CDtrack>())).offset as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_CDtrack),
            "::",
            stringify!(offset)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_CD {
    pub id: ::std::os::raw::c_int,
    pub status: CDstatus,
    pub numtracks: ::std::os::raw::c_int,
    pub cur_track: ::std::os::raw::c_int,
    pub cur_frame: ::std::os::raw::c_int,
    pub track: [SDL_CDtrack; 100usize],
}
#[test]
fn bindgen_test_layout_SDL_CD() {
    assert_eq!(
        ::std::mem::size_of::<SDL_CD>(),
        1220usize,
        concat!("Size of: ", stringify!(SDL_CD))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_CD>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_CD))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_CD>())).id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_CD),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_CD>())).status as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_CD),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_CD>())).numtracks as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_CD),
            "::",
            stringify!(numtracks)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_CD>())).cur_track as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_CD),
            "::",
            stringify!(cur_track)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_CD>())).cur_frame as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_CD),
            "::",
            stringify!(cur_frame)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_CD>())).track as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_CD),
            "::",
            stringify!(track)
        )
    );
}
impl Default for SDL_CD {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub fn SDL_CDNumDrives() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_CDName(drive: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn SDL_CDOpen(drive: ::std::os::raw::c_int) -> *mut SDL_CD;
}
extern "C" {
    pub fn SDL_CDStatus(cdrom: *mut SDL_CD) -> CDstatus;
}
extern "C" {
    pub fn SDL_CDPlayTracks(
        cdrom: *mut SDL_CD,
        start_track: ::std::os::raw::c_int,
        start_frame: ::std::os::raw::c_int,
        ntracks: ::std::os::raw::c_int,
        nframes: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_CDPlay(
        cdrom: *mut SDL_CD,
        start: ::std::os::raw::c_int,
        length: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_CDPause(cdrom: *mut SDL_CD) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_CDResume(cdrom: *mut SDL_CD) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_CDStop(cdrom: *mut SDL_CD) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_CDEject(cdrom: *mut SDL_CD) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_CDClose(cdrom: *mut SDL_CD);
}
extern "C" {
    pub fn SDL_HasRDTSC() -> SDL_bool;
}
extern "C" {
    pub fn SDL_HasMMX() -> SDL_bool;
}
extern "C" {
    pub fn SDL_HasMMXExt() -> SDL_bool;
}
extern "C" {
    pub fn SDL_Has3DNow() -> SDL_bool;
}
extern "C" {
    pub fn SDL_Has3DNowExt() -> SDL_bool;
}
extern "C" {
    pub fn SDL_HasSSE() -> SDL_bool;
}
extern "C" {
    pub fn SDL_HasSSE2() -> SDL_bool;
}
extern "C" {
    pub fn SDL_HasAltiVec() -> SDL_bool;
}
extern "C" {
    pub fn SDL_GetAppState() -> Uint8;
}
pub const SDLKey_SDLK_UNKNOWN: SDLKey = 0;
pub const SDLKey_SDLK_FIRST: SDLKey = 0;
pub const SDLKey_SDLK_BACKSPACE: SDLKey = 8;
pub const SDLKey_SDLK_TAB: SDLKey = 9;
pub const SDLKey_SDLK_CLEAR: SDLKey = 12;
pub const SDLKey_SDLK_RETURN: SDLKey = 13;
pub const SDLKey_SDLK_PAUSE: SDLKey = 19;
pub const SDLKey_SDLK_ESCAPE: SDLKey = 27;
pub const SDLKey_SDLK_SPACE: SDLKey = 32;
pub const SDLKey_SDLK_EXCLAIM: SDLKey = 33;
pub const SDLKey_SDLK_QUOTEDBL: SDLKey = 34;
pub const SDLKey_SDLK_HASH: SDLKey = 35;
pub const SDLKey_SDLK_DOLLAR: SDLKey = 36;
pub const SDLKey_SDLK_AMPERSAND: SDLKey = 38;
pub const SDLKey_SDLK_QUOTE: SDLKey = 39;
pub const SDLKey_SDLK_LEFTPAREN: SDLKey = 40;
pub const SDLKey_SDLK_RIGHTPAREN: SDLKey = 41;
pub const SDLKey_SDLK_ASTERISK: SDLKey = 42;
pub const SDLKey_SDLK_PLUS: SDLKey = 43;
pub const SDLKey_SDLK_COMMA: SDLKey = 44;
pub const SDLKey_SDLK_MINUS: SDLKey = 45;
pub const SDLKey_SDLK_PERIOD: SDLKey = 46;
pub const SDLKey_SDLK_SLASH: SDLKey = 47;
pub const SDLKey_SDLK_0: SDLKey = 48;
pub const SDLKey_SDLK_1: SDLKey = 49;
pub const SDLKey_SDLK_2: SDLKey = 50;
pub const SDLKey_SDLK_3: SDLKey = 51;
pub const SDLKey_SDLK_4: SDLKey = 52;
pub const SDLKey_SDLK_5: SDLKey = 53;
pub const SDLKey_SDLK_6: SDLKey = 54;
pub const SDLKey_SDLK_7: SDLKey = 55;
pub const SDLKey_SDLK_8: SDLKey = 56;
pub const SDLKey_SDLK_9: SDLKey = 57;
pub const SDLKey_SDLK_COLON: SDLKey = 58;
pub const SDLKey_SDLK_SEMICOLON: SDLKey = 59;
pub const SDLKey_SDLK_LESS: SDLKey = 60;
pub const SDLKey_SDLK_EQUALS: SDLKey = 61;
pub const SDLKey_SDLK_GREATER: SDLKey = 62;
pub const SDLKey_SDLK_QUESTION: SDLKey = 63;
pub const SDLKey_SDLK_AT: SDLKey = 64;
pub const SDLKey_SDLK_LEFTBRACKET: SDLKey = 91;
pub const SDLKey_SDLK_BACKSLASH: SDLKey = 92;
pub const SDLKey_SDLK_RIGHTBRACKET: SDLKey = 93;
pub const SDLKey_SDLK_CARET: SDLKey = 94;
pub const SDLKey_SDLK_UNDERSCORE: SDLKey = 95;
pub const SDLKey_SDLK_BACKQUOTE: SDLKey = 96;
pub const SDLKey_SDLK_a: SDLKey = 97;
pub const SDLKey_SDLK_b: SDLKey = 98;
pub const SDLKey_SDLK_c: SDLKey = 99;
pub const SDLKey_SDLK_d: SDLKey = 100;
pub const SDLKey_SDLK_e: SDLKey = 101;
pub const SDLKey_SDLK_f: SDLKey = 102;
pub const SDLKey_SDLK_g: SDLKey = 103;
pub const SDLKey_SDLK_h: SDLKey = 104;
pub const SDLKey_SDLK_i: SDLKey = 105;
pub const SDLKey_SDLK_j: SDLKey = 106;
pub const SDLKey_SDLK_k: SDLKey = 107;
pub const SDLKey_SDLK_l: SDLKey = 108;
pub const SDLKey_SDLK_m: SDLKey = 109;
pub const SDLKey_SDLK_n: SDLKey = 110;
pub const SDLKey_SDLK_o: SDLKey = 111;
pub const SDLKey_SDLK_p: SDLKey = 112;
pub const SDLKey_SDLK_q: SDLKey = 113;
pub const SDLKey_SDLK_r: SDLKey = 114;
pub const SDLKey_SDLK_s: SDLKey = 115;
pub const SDLKey_SDLK_t: SDLKey = 116;
pub const SDLKey_SDLK_u: SDLKey = 117;
pub const SDLKey_SDLK_v: SDLKey = 118;
pub const SDLKey_SDLK_w: SDLKey = 119;
pub const SDLKey_SDLK_x: SDLKey = 120;
pub const SDLKey_SDLK_y: SDLKey = 121;
pub const SDLKey_SDLK_z: SDLKey = 122;
pub const SDLKey_SDLK_DELETE: SDLKey = 127;
pub const SDLKey_SDLK_WORLD_0: SDLKey = 160;
pub const SDLKey_SDLK_WORLD_1: SDLKey = 161;
pub const SDLKey_SDLK_WORLD_2: SDLKey = 162;
pub const SDLKey_SDLK_WORLD_3: SDLKey = 163;
pub const SDLKey_SDLK_WORLD_4: SDLKey = 164;
pub const SDLKey_SDLK_WORLD_5: SDLKey = 165;
pub const SDLKey_SDLK_WORLD_6: SDLKey = 166;
pub const SDLKey_SDLK_WORLD_7: SDLKey = 167;
pub const SDLKey_SDLK_WORLD_8: SDLKey = 168;
pub const SDLKey_SDLK_WORLD_9: SDLKey = 169;
pub const SDLKey_SDLK_WORLD_10: SDLKey = 170;
pub const SDLKey_SDLK_WORLD_11: SDLKey = 171;
pub const SDLKey_SDLK_WORLD_12: SDLKey = 172;
pub const SDLKey_SDLK_WORLD_13: SDLKey = 173;
pub const SDLKey_SDLK_WORLD_14: SDLKey = 174;
pub const SDLKey_SDLK_WORLD_15: SDLKey = 175;
pub const SDLKey_SDLK_WORLD_16: SDLKey = 176;
pub const SDLKey_SDLK_WORLD_17: SDLKey = 177;
pub const SDLKey_SDLK_WORLD_18: SDLKey = 178;
pub const SDLKey_SDLK_WORLD_19: SDLKey = 179;
pub const SDLKey_SDLK_WORLD_20: SDLKey = 180;
pub const SDLKey_SDLK_WORLD_21: SDLKey = 181;
pub const SDLKey_SDLK_WORLD_22: SDLKey = 182;
pub const SDLKey_SDLK_WORLD_23: SDLKey = 183;
pub const SDLKey_SDLK_WORLD_24: SDLKey = 184;
pub const SDLKey_SDLK_WORLD_25: SDLKey = 185;
pub const SDLKey_SDLK_WORLD_26: SDLKey = 186;
pub const SDLKey_SDLK_WORLD_27: SDLKey = 187;
pub const SDLKey_SDLK_WORLD_28: SDLKey = 188;
pub const SDLKey_SDLK_WORLD_29: SDLKey = 189;
pub const SDLKey_SDLK_WORLD_30: SDLKey = 190;
pub const SDLKey_SDLK_WORLD_31: SDLKey = 191;
pub const SDLKey_SDLK_WORLD_32: SDLKey = 192;
pub const SDLKey_SDLK_WORLD_33: SDLKey = 193;
pub const SDLKey_SDLK_WORLD_34: SDLKey = 194;
pub const SDLKey_SDLK_WORLD_35: SDLKey = 195;
pub const SDLKey_SDLK_WORLD_36: SDLKey = 196;
pub const SDLKey_SDLK_WORLD_37: SDLKey = 197;
pub const SDLKey_SDLK_WORLD_38: SDLKey = 198;
pub const SDLKey_SDLK_WORLD_39: SDLKey = 199;
pub const SDLKey_SDLK_WORLD_40: SDLKey = 200;
pub const SDLKey_SDLK_WORLD_41: SDLKey = 201;
pub const SDLKey_SDLK_WORLD_42: SDLKey = 202;
pub const SDLKey_SDLK_WORLD_43: SDLKey = 203;
pub const SDLKey_SDLK_WORLD_44: SDLKey = 204;
pub const SDLKey_SDLK_WORLD_45: SDLKey = 205;
pub const SDLKey_SDLK_WORLD_46: SDLKey = 206;
pub const SDLKey_SDLK_WORLD_47: SDLKey = 207;
pub const SDLKey_SDLK_WORLD_48: SDLKey = 208;
pub const SDLKey_SDLK_WORLD_49: SDLKey = 209;
pub const SDLKey_SDLK_WORLD_50: SDLKey = 210;
pub const SDLKey_SDLK_WORLD_51: SDLKey = 211;
pub const SDLKey_SDLK_WORLD_52: SDLKey = 212;
pub const SDLKey_SDLK_WORLD_53: SDLKey = 213;
pub const SDLKey_SDLK_WORLD_54: SDLKey = 214;
pub const SDLKey_SDLK_WORLD_55: SDLKey = 215;
pub const SDLKey_SDLK_WORLD_56: SDLKey = 216;
pub const SDLKey_SDLK_WORLD_57: SDLKey = 217;
pub const SDLKey_SDLK_WORLD_58: SDLKey = 218;
pub const SDLKey_SDLK_WORLD_59: SDLKey = 219;
pub const SDLKey_SDLK_WORLD_60: SDLKey = 220;
pub const SDLKey_SDLK_WORLD_61: SDLKey = 221;
pub const SDLKey_SDLK_WORLD_62: SDLKey = 222;
pub const SDLKey_SDLK_WORLD_63: SDLKey = 223;
pub const SDLKey_SDLK_WORLD_64: SDLKey = 224;
pub const SDLKey_SDLK_WORLD_65: SDLKey = 225;
pub const SDLKey_SDLK_WORLD_66: SDLKey = 226;
pub const SDLKey_SDLK_WORLD_67: SDLKey = 227;
pub const SDLKey_SDLK_WORLD_68: SDLKey = 228;
pub const SDLKey_SDLK_WORLD_69: SDLKey = 229;
pub const SDLKey_SDLK_WORLD_70: SDLKey = 230;
pub const SDLKey_SDLK_WORLD_71: SDLKey = 231;
pub const SDLKey_SDLK_WORLD_72: SDLKey = 232;
pub const SDLKey_SDLK_WORLD_73: SDLKey = 233;
pub const SDLKey_SDLK_WORLD_74: SDLKey = 234;
pub const SDLKey_SDLK_WORLD_75: SDLKey = 235;
pub const SDLKey_SDLK_WORLD_76: SDLKey = 236;
pub const SDLKey_SDLK_WORLD_77: SDLKey = 237;
pub const SDLKey_SDLK_WORLD_78: SDLKey = 238;
pub const SDLKey_SDLK_WORLD_79: SDLKey = 239;
pub const SDLKey_SDLK_WORLD_80: SDLKey = 240;
pub const SDLKey_SDLK_WORLD_81: SDLKey = 241;
pub const SDLKey_SDLK_WORLD_82: SDLKey = 242;
pub const SDLKey_SDLK_WORLD_83: SDLKey = 243;
pub const SDLKey_SDLK_WORLD_84: SDLKey = 244;
pub const SDLKey_SDLK_WORLD_85: SDLKey = 245;
pub const SDLKey_SDLK_WORLD_86: SDLKey = 246;
pub const SDLKey_SDLK_WORLD_87: SDLKey = 247;
pub const SDLKey_SDLK_WORLD_88: SDLKey = 248;
pub const SDLKey_SDLK_WORLD_89: SDLKey = 249;
pub const SDLKey_SDLK_WORLD_90: SDLKey = 250;
pub const SDLKey_SDLK_WORLD_91: SDLKey = 251;
pub const SDLKey_SDLK_WORLD_92: SDLKey = 252;
pub const SDLKey_SDLK_WORLD_93: SDLKey = 253;
pub const SDLKey_SDLK_WORLD_94: SDLKey = 254;
pub const SDLKey_SDLK_WORLD_95: SDLKey = 255;
pub const SDLKey_SDLK_KP0: SDLKey = 256;
pub const SDLKey_SDLK_KP1: SDLKey = 257;
pub const SDLKey_SDLK_KP2: SDLKey = 258;
pub const SDLKey_SDLK_KP3: SDLKey = 259;
pub const SDLKey_SDLK_KP4: SDLKey = 260;
pub const SDLKey_SDLK_KP5: SDLKey = 261;
pub const SDLKey_SDLK_KP6: SDLKey = 262;
pub const SDLKey_SDLK_KP7: SDLKey = 263;
pub const SDLKey_SDLK_KP8: SDLKey = 264;
pub const SDLKey_SDLK_KP9: SDLKey = 265;
pub const SDLKey_SDLK_KP_PERIOD: SDLKey = 266;
pub const SDLKey_SDLK_KP_DIVIDE: SDLKey = 267;
pub const SDLKey_SDLK_KP_MULTIPLY: SDLKey = 268;
pub const SDLKey_SDLK_KP_MINUS: SDLKey = 269;
pub const SDLKey_SDLK_KP_PLUS: SDLKey = 270;
pub const SDLKey_SDLK_KP_ENTER: SDLKey = 271;
pub const SDLKey_SDLK_KP_EQUALS: SDLKey = 272;
pub const SDLKey_SDLK_UP: SDLKey = 273;
pub const SDLKey_SDLK_DOWN: SDLKey = 274;
pub const SDLKey_SDLK_RIGHT: SDLKey = 275;
pub const SDLKey_SDLK_LEFT: SDLKey = 276;
pub const SDLKey_SDLK_INSERT: SDLKey = 277;
pub const SDLKey_SDLK_HOME: SDLKey = 278;
pub const SDLKey_SDLK_END: SDLKey = 279;
pub const SDLKey_SDLK_PAGEUP: SDLKey = 280;
pub const SDLKey_SDLK_PAGEDOWN: SDLKey = 281;
pub const SDLKey_SDLK_F1: SDLKey = 282;
pub const SDLKey_SDLK_F2: SDLKey = 283;
pub const SDLKey_SDLK_F3: SDLKey = 284;
pub const SDLKey_SDLK_F4: SDLKey = 285;
pub const SDLKey_SDLK_F5: SDLKey = 286;
pub const SDLKey_SDLK_F6: SDLKey = 287;
pub const SDLKey_SDLK_F7: SDLKey = 288;
pub const SDLKey_SDLK_F8: SDLKey = 289;
pub const SDLKey_SDLK_F9: SDLKey = 290;
pub const SDLKey_SDLK_F10: SDLKey = 291;
pub const SDLKey_SDLK_F11: SDLKey = 292;
pub const SDLKey_SDLK_F12: SDLKey = 293;
pub const SDLKey_SDLK_F13: SDLKey = 294;
pub const SDLKey_SDLK_F14: SDLKey = 295;
pub const SDLKey_SDLK_F15: SDLKey = 296;
pub const SDLKey_SDLK_NUMLOCK: SDLKey = 300;
pub const SDLKey_SDLK_CAPSLOCK: SDLKey = 301;
pub const SDLKey_SDLK_SCROLLOCK: SDLKey = 302;
pub const SDLKey_SDLK_RSHIFT: SDLKey = 303;
pub const SDLKey_SDLK_LSHIFT: SDLKey = 304;
pub const SDLKey_SDLK_RCTRL: SDLKey = 305;
pub const SDLKey_SDLK_LCTRL: SDLKey = 306;
pub const SDLKey_SDLK_RALT: SDLKey = 307;
pub const SDLKey_SDLK_LALT: SDLKey = 308;
pub const SDLKey_SDLK_RMETA: SDLKey = 309;
pub const SDLKey_SDLK_LMETA: SDLKey = 310;
pub const SDLKey_SDLK_LSUPER: SDLKey = 311;
pub const SDLKey_SDLK_RSUPER: SDLKey = 312;
pub const SDLKey_SDLK_MODE: SDLKey = 313;
pub const SDLKey_SDLK_COMPOSE: SDLKey = 314;
pub const SDLKey_SDLK_HELP: SDLKey = 315;
pub const SDLKey_SDLK_PRINT: SDLKey = 316;
pub const SDLKey_SDLK_SYSREQ: SDLKey = 317;
pub const SDLKey_SDLK_BREAK: SDLKey = 318;
pub const SDLKey_SDLK_MENU: SDLKey = 319;
pub const SDLKey_SDLK_POWER: SDLKey = 320;
pub const SDLKey_SDLK_EURO: SDLKey = 321;
pub const SDLKey_SDLK_UNDO: SDLKey = 322;
pub const SDLKey_SDLK_LAST: SDLKey = 323;
pub type SDLKey = ::std::os::raw::c_uint;
pub const SDLMod_KMOD_NONE: SDLMod = 0;
pub const SDLMod_KMOD_LSHIFT: SDLMod = 1;
pub const SDLMod_KMOD_RSHIFT: SDLMod = 2;
pub const SDLMod_KMOD_LCTRL: SDLMod = 64;
pub const SDLMod_KMOD_RCTRL: SDLMod = 128;
pub const SDLMod_KMOD_LALT: SDLMod = 256;
pub const SDLMod_KMOD_RALT: SDLMod = 512;
pub const SDLMod_KMOD_LMETA: SDLMod = 1024;
pub const SDLMod_KMOD_RMETA: SDLMod = 2048;
pub const SDLMod_KMOD_NUM: SDLMod = 4096;
pub const SDLMod_KMOD_CAPS: SDLMod = 8192;
pub const SDLMod_KMOD_MODE: SDLMod = 16384;
pub const SDLMod_KMOD_RESERVED: SDLMod = 32768;
pub type SDLMod = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_keysym {
    pub scancode: Uint8,
    pub sym: SDLKey,
    pub mod_: SDLMod,
    pub unicode: Uint16,
}
#[test]
fn bindgen_test_layout_SDL_keysym() {
    assert_eq!(
        ::std::mem::size_of::<SDL_keysym>(),
        16usize,
        concat!("Size of: ", stringify!(SDL_keysym))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_keysym>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_keysym))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_keysym>())).scancode as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_keysym),
            "::",
            stringify!(scancode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_keysym>())).sym as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_keysym),
            "::",
            stringify!(sym)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_keysym>())).mod_ as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_keysym),
            "::",
            stringify!(mod_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_keysym>())).unicode as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_keysym),
            "::",
            stringify!(unicode)
        )
    );
}
impl Default for SDL_keysym {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub fn SDL_EnableUNICODE(enable: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_EnableKeyRepeat(
        delay: ::std::os::raw::c_int,
        interval: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_GetKeyRepeat(
        delay: *mut ::std::os::raw::c_int,
        interval: *mut ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn SDL_GetKeyState(numkeys: *mut ::std::os::raw::c_int) -> *mut Uint8;
}
extern "C" {
    pub fn SDL_GetModState() -> SDLMod;
}
extern "C" {
    pub fn SDL_SetModState(modstate: SDLMod);
}
extern "C" {
    pub fn SDL_GetKeyName(key: SDLKey) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SDL_Rect {
    pub x: Sint16,
    pub y: Sint16,
    pub w: Uint16,
    pub h: Uint16,
}
#[test]
fn bindgen_test_layout_SDL_Rect() {
    assert_eq!(
        ::std::mem::size_of::<SDL_Rect>(),
        8usize,
        concat!("Size of: ", stringify!(SDL_Rect))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_Rect>(),
        2usize,
        concat!("Alignment of ", stringify!(SDL_Rect))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Rect>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Rect),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Rect>())).y as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Rect),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Rect>())).w as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Rect),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Rect>())).h as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Rect),
            "::",
            stringify!(h)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SDL_Color {
    pub r: Uint8,
    pub g: Uint8,
    pub b: Uint8,
    pub unused: Uint8,
}
#[test]
fn bindgen_test_layout_SDL_Color() {
    assert_eq!(
        ::std::mem::size_of::<SDL_Color>(),
        4usize,
        concat!("Size of: ", stringify!(SDL_Color))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_Color>(),
        1usize,
        concat!("Alignment of ", stringify!(SDL_Color))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Color>())).r as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Color),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Color>())).g as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Color),
            "::",
            stringify!(g)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Color>())).b as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Color),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Color>())).unused as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Color),
            "::",
            stringify!(unused)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_Palette {
    pub ncolors: ::std::os::raw::c_int,
    pub colors: *mut SDL_Color,
}
#[test]
fn bindgen_test_layout_SDL_Palette() {
    assert_eq!(
        ::std::mem::size_of::<SDL_Palette>(),
        16usize,
        concat!("Size of: ", stringify!(SDL_Palette))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_Palette>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_Palette))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Palette>())).ncolors as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Palette),
            "::",
            stringify!(ncolors)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Palette>())).colors as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Palette),
            "::",
            stringify!(colors)
        )
    );
}
impl Default for SDL_Palette {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_PixelFormat {
    pub palette: *mut SDL_Palette,
    pub BitsPerPixel: Uint8,
    pub BytesPerPixel: Uint8,
    pub Rloss: Uint8,
    pub Gloss: Uint8,
    pub Bloss: Uint8,
    pub Aloss: Uint8,
    pub Rshift: Uint8,
    pub Gshift: Uint8,
    pub Bshift: Uint8,
    pub Ashift: Uint8,
    pub Rmask: Uint32,
    pub Gmask: Uint32,
    pub Bmask: Uint32,
    pub Amask: Uint32,
    pub colorkey: Uint32,
    pub alpha: Uint8,
}
#[test]
fn bindgen_test_layout_SDL_PixelFormat() {
    assert_eq!(
        ::std::mem::size_of::<SDL_PixelFormat>(),
        48usize,
        concat!("Size of: ", stringify!(SDL_PixelFormat))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_PixelFormat>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_PixelFormat))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).palette as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(palette)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).BitsPerPixel as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(BitsPerPixel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).BytesPerPixel as *const _ as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(BytesPerPixel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).Rloss as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Rloss)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).Gloss as *const _ as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Gloss)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).Bloss as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Bloss)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).Aloss as *const _ as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Aloss)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).Rshift as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Rshift)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).Gshift as *const _ as usize },
        15usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Gshift)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).Bshift as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Bshift)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).Ashift as *const _ as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Ashift)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).Rmask as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Rmask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).Gmask as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Gmask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).Bmask as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Bmask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).Amask as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Amask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).colorkey as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(colorkey)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).alpha as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(alpha)
        )
    );
}
impl Default for SDL_PixelFormat {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_Surface {
    pub flags: Uint32,
    pub format: *mut SDL_PixelFormat,
    pub w: ::std::os::raw::c_int,
    pub h: ::std::os::raw::c_int,
    pub pitch: Uint16,
    pub pixels: *mut ::std::os::raw::c_void,
    pub offset: ::std::os::raw::c_int,
    pub hwdata: *mut private_hwdata,
    pub clip_rect: SDL_Rect,
    pub unused1: Uint32,
    pub locked: Uint32,
    pub map: *mut SDL_BlitMap,
    pub format_version: ::std::os::raw::c_uint,
    pub refcount: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_SDL_Surface() {
    assert_eq!(
        ::std::mem::size_of::<SDL_Surface>(),
        88usize,
        concat!("Size of: ", stringify!(SDL_Surface))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_Surface>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_Surface))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Surface>())).flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Surface>())).format as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Surface>())).w as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Surface>())).h as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(h)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Surface>())).pitch as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(pitch)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Surface>())).pixels as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(pixels)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Surface>())).offset as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Surface>())).hwdata as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(hwdata)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Surface>())).clip_rect as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(clip_rect)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Surface>())).unused1 as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(unused1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Surface>())).locked as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(locked)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Surface>())).map as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(map)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Surface>())).format_version as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(format_version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Surface>())).refcount as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(refcount)
        )
    );
}
impl Default for SDL_Surface {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type SDL_blit = ::std::option::Option<
    unsafe extern "C" fn(
        src: *mut SDL_Surface,
        srcrect: *mut SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *mut SDL_Rect,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_VideoInfo {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u16>,
    pub video_mem: Uint32,
    pub vfmt: *mut SDL_PixelFormat,
    pub current_w: ::std::os::raw::c_int,
    pub current_h: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_SDL_VideoInfo() {
    assert_eq!(
        ::std::mem::size_of::<SDL_VideoInfo>(),
        24usize,
        concat!("Size of: ", stringify!(SDL_VideoInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_VideoInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_VideoInfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_VideoInfo>())).video_mem as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_VideoInfo),
            "::",
            stringify!(video_mem)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_VideoInfo>())).vfmt as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_VideoInfo),
            "::",
            stringify!(vfmt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_VideoInfo>())).current_w as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_VideoInfo),
            "::",
            stringify!(current_w)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_VideoInfo>())).current_h as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_VideoInfo),
            "::",
            stringify!(current_h)
        )
    );
}
impl Default for SDL_VideoInfo {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
impl SDL_VideoInfo {
    #[inline]
    pub fn hw_available(&self) -> Uint32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_hw_available(&mut self, val: Uint32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn wm_available(&self) -> Uint32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_wm_available(&mut self, val: Uint32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn UnusedBits1(&self) -> Uint32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 6u8) as u32) }
    }
    #[inline]
    pub fn set_UnusedBits1(&mut self, val: Uint32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub fn UnusedBits2(&self) -> Uint32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_UnusedBits2(&mut self, val: Uint32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn blit_hw(&self) -> Uint32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_blit_hw(&mut self, val: Uint32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn blit_hw_CC(&self) -> Uint32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_blit_hw_CC(&mut self, val: Uint32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn blit_hw_A(&self) -> Uint32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_blit_hw_A(&mut self, val: Uint32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn blit_sw(&self) -> Uint32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_blit_sw(&mut self, val: Uint32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn blit_sw_CC(&self) -> Uint32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_blit_sw_CC(&mut self, val: Uint32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn blit_sw_A(&self) -> Uint32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_blit_sw_A(&mut self, val: Uint32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn blit_fill(&self) -> Uint32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_blit_fill(&mut self, val: Uint32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn UnusedBits3(&self) -> Uint32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_UnusedBits3(&mut self, val: Uint32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        hw_available: Uint32,
        wm_available: Uint32,
        UnusedBits1: Uint32,
        UnusedBits2: Uint32,
        blit_hw: Uint32,
        blit_hw_CC: Uint32,
        blit_hw_A: Uint32,
        blit_sw: Uint32,
        blit_sw_CC: Uint32,
        blit_sw_A: Uint32,
        blit_fill: Uint32,
        UnusedBits3: Uint32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let hw_available: u32 = unsafe { ::std::mem::transmute(hw_available) };
            hw_available as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let wm_available: u32 = unsafe { ::std::mem::transmute(wm_available) };
            wm_available as u64
        });
        __bindgen_bitfield_unit.set(2usize, 6u8, {
            let UnusedBits1: u32 = unsafe { ::std::mem::transmute(UnusedBits1) };
            UnusedBits1 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let UnusedBits2: u32 = unsafe { ::std::mem::transmute(UnusedBits2) };
            UnusedBits2 as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let blit_hw: u32 = unsafe { ::std::mem::transmute(blit_hw) };
            blit_hw as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let blit_hw_CC: u32 = unsafe { ::std::mem::transmute(blit_hw_CC) };
            blit_hw_CC as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let blit_hw_A: u32 = unsafe { ::std::mem::transmute(blit_hw_A) };
            blit_hw_A as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let blit_sw: u32 = unsafe { ::std::mem::transmute(blit_sw) };
            blit_sw as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let blit_sw_CC: u32 = unsafe { ::std::mem::transmute(blit_sw_CC) };
            blit_sw_CC as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let blit_sw_A: u32 = unsafe { ::std::mem::transmute(blit_sw_A) };
            blit_sw_A as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let blit_fill: u32 = unsafe { ::std::mem::transmute(blit_fill) };
            blit_fill as u64
        });
        __bindgen_bitfield_unit.set(16usize, 16u8, {
            let UnusedBits3: u32 = unsafe { ::std::mem::transmute(UnusedBits3) };
            UnusedBits3 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_Overlay {
    pub format: Uint32,
    pub w: ::std::os::raw::c_int,
    pub h: ::std::os::raw::c_int,
    pub planes: ::std::os::raw::c_int,
    pub pitches: *mut Uint16,
    pub pixels: *mut *mut Uint8,
    pub hwfuncs: *mut private_yuvhwfuncs,
    pub hwdata: *mut private_yuvhwdata,
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u32>,
    pub __bindgen_padding_0: u32,
}
#[test]
fn bindgen_test_layout_SDL_Overlay() {
    assert_eq!(
        ::std::mem::size_of::<SDL_Overlay>(),
        56usize,
        concat!("Size of: ", stringify!(SDL_Overlay))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_Overlay>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_Overlay))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Overlay>())).format as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Overlay),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Overlay>())).w as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Overlay),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Overlay>())).h as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Overlay),
            "::",
            stringify!(h)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Overlay>())).planes as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Overlay),
            "::",
            stringify!(planes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Overlay>())).pitches as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Overlay),
            "::",
            stringify!(pitches)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Overlay>())).pixels as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Overlay),
            "::",
            stringify!(pixels)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Overlay>())).hwfuncs as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Overlay),
            "::",
            stringify!(hwfuncs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Overlay>())).hwdata as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Overlay),
            "::",
            stringify!(hwdata)
        )
    );
}
impl Default for SDL_Overlay {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
impl SDL_Overlay {
    #[inline]
    pub fn hw_overlay(&self) -> Uint32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_hw_overlay(&mut self, val: Uint32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn UnusedBits(&self) -> Uint32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 31u8) as u32) }
    }
    #[inline]
    pub fn set_UnusedBits(&mut self, val: Uint32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 31u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        hw_overlay: Uint32,
        UnusedBits: Uint32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u32> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u32> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let hw_overlay: u32 = unsafe { ::std::mem::transmute(hw_overlay) };
            hw_overlay as u64
        });
        __bindgen_bitfield_unit.set(1usize, 31u8, {
            let UnusedBits: u32 = unsafe { ::std::mem::transmute(UnusedBits) };
            UnusedBits as u64
        });
        __bindgen_bitfield_unit
    }
}
pub const SDL_GLattr_SDL_GL_RED_SIZE: SDL_GLattr = 0;
pub const SDL_GLattr_SDL_GL_GREEN_SIZE: SDL_GLattr = 1;
pub const SDL_GLattr_SDL_GL_BLUE_SIZE: SDL_GLattr = 2;
pub const SDL_GLattr_SDL_GL_ALPHA_SIZE: SDL_GLattr = 3;
pub const SDL_GLattr_SDL_GL_BUFFER_SIZE: SDL_GLattr = 4;
pub const SDL_GLattr_SDL_GL_DOUBLEBUFFER: SDL_GLattr = 5;
pub const SDL_GLattr_SDL_GL_DEPTH_SIZE: SDL_GLattr = 6;
pub const SDL_GLattr_SDL_GL_STENCIL_SIZE: SDL_GLattr = 7;
pub const SDL_GLattr_SDL_GL_ACCUM_RED_SIZE: SDL_GLattr = 8;
pub const SDL_GLattr_SDL_GL_ACCUM_GREEN_SIZE: SDL_GLattr = 9;
pub const SDL_GLattr_SDL_GL_ACCUM_BLUE_SIZE: SDL_GLattr = 10;
pub const SDL_GLattr_SDL_GL_ACCUM_ALPHA_SIZE: SDL_GLattr = 11;
pub const SDL_GLattr_SDL_GL_STEREO: SDL_GLattr = 12;
pub const SDL_GLattr_SDL_GL_MULTISAMPLEBUFFERS: SDL_GLattr = 13;
pub const SDL_GLattr_SDL_GL_MULTISAMPLESAMPLES: SDL_GLattr = 14;
pub const SDL_GLattr_SDL_GL_ACCELERATED_VISUAL: SDL_GLattr = 15;
pub const SDL_GLattr_SDL_GL_SWAP_CONTROL: SDL_GLattr = 16;
pub type SDL_GLattr = ::std::os::raw::c_uint;
extern "C" {
    pub fn SDL_VideoInit(
        driver_name: *const ::std::os::raw::c_char,
        flags: Uint32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_VideoQuit();
}
extern "C" {
    pub fn SDL_VideoDriverName(
        namebuf: *mut ::std::os::raw::c_char,
        maxlen: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn SDL_GetVideoSurface() -> *mut SDL_Surface;
}
extern "C" {
    pub fn SDL_GetVideoInfo() -> *const SDL_VideoInfo;
}
extern "C" {
    pub fn SDL_VideoModeOK(
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
        bpp: ::std::os::raw::c_int,
        flags: Uint32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_ListModes(format: *mut SDL_PixelFormat, flags: Uint32) -> *mut *mut SDL_Rect;
}
extern "C" {
    pub fn SDL_SetVideoMode(
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
        bpp: ::std::os::raw::c_int,
        flags: Uint32,
    ) -> *mut SDL_Surface;
}
extern "C" {
    pub fn SDL_UpdateRects(
        screen: *mut SDL_Surface,
        numrects: ::std::os::raw::c_int,
        rects: *mut SDL_Rect,
    );
}
extern "C" {
    pub fn SDL_UpdateRect(screen: *mut SDL_Surface, x: Sint32, y: Sint32, w: Uint32, h: Uint32);
}
extern "C" {
    pub fn SDL_Flip(screen: *mut SDL_Surface) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_SetGamma(red: f32, green: f32, blue: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_SetGammaRamp(
        red: *const Uint16,
        green: *const Uint16,
        blue: *const Uint16,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_GetGammaRamp(
        red: *mut Uint16,
        green: *mut Uint16,
        blue: *mut Uint16,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_SetColors(
        surface: *mut SDL_Surface,
        colors: *mut SDL_Color,
        firstcolor: ::std::os::raw::c_int,
        ncolors: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_SetPalette(
        surface: *mut SDL_Surface,
        flags: ::std::os::raw::c_int,
        colors: *mut SDL_Color,
        firstcolor: ::std::os::raw::c_int,
        ncolors: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_MapRGB(format: *const SDL_PixelFormat, r: Uint8, g: Uint8, b: Uint8) -> Uint32;
}
extern "C" {
    pub fn SDL_MapRGBA(
        format: *const SDL_PixelFormat,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> Uint32;
}
extern "C" {
    pub fn SDL_GetRGB(
        pixel: Uint32,
        fmt: *const SDL_PixelFormat,
        r: *mut Uint8,
        g: *mut Uint8,
        b: *mut Uint8,
    );
}
extern "C" {
    pub fn SDL_GetRGBA(
        pixel: Uint32,
        fmt: *const SDL_PixelFormat,
        r: *mut Uint8,
        g: *mut Uint8,
        b: *mut Uint8,
        a: *mut Uint8,
    );
}
extern "C" {
    pub fn SDL_CreateRGBSurface(
        flags: Uint32,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
        depth: ::std::os::raw::c_int,
        Rmask: Uint32,
        Gmask: Uint32,
        Bmask: Uint32,
        Amask: Uint32,
    ) -> *mut SDL_Surface;
}
extern "C" {
    pub fn SDL_CreateRGBSurfaceFrom(
        pixels: *mut ::std::os::raw::c_void,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
        depth: ::std::os::raw::c_int,
        pitch: ::std::os::raw::c_int,
        Rmask: Uint32,
        Gmask: Uint32,
        Bmask: Uint32,
        Amask: Uint32,
    ) -> *mut SDL_Surface;
}
extern "C" {
    pub fn SDL_FreeSurface(surface: *mut SDL_Surface);
}
extern "C" {
    pub fn SDL_LockSurface(surface: *mut SDL_Surface) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_UnlockSurface(surface: *mut SDL_Surface);
}
extern "C" {
    pub fn SDL_LoadBMP_RW(src: *mut SDL_RWops, freesrc: ::std::os::raw::c_int) -> *mut SDL_Surface;
}
extern "C" {
    pub fn SDL_SaveBMP_RW(
        surface: *mut SDL_Surface,
        dst: *mut SDL_RWops,
        freedst: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_SetColorKey(
        surface: *mut SDL_Surface,
        flag: Uint32,
        key: Uint32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_SetAlpha(
        surface: *mut SDL_Surface,
        flag: Uint32,
        alpha: Uint8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_SetClipRect(surface: *mut SDL_Surface, rect: *const SDL_Rect) -> SDL_bool;
}
extern "C" {
    pub fn SDL_GetClipRect(surface: *mut SDL_Surface, rect: *mut SDL_Rect);
}
extern "C" {
    pub fn SDL_ConvertSurface(
        src: *mut SDL_Surface,
        fmt: *mut SDL_PixelFormat,
        flags: Uint32,
    ) -> *mut SDL_Surface;
}
extern "C" {
    pub fn SDL_UpperBlit(
        src: *mut SDL_Surface,
        srcrect: *mut SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *mut SDL_Rect,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_LowerBlit(
        src: *mut SDL_Surface,
        srcrect: *mut SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *mut SDL_Rect,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_FillRect(
        dst: *mut SDL_Surface,
        dstrect: *mut SDL_Rect,
        color: Uint32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_DisplayFormat(surface: *mut SDL_Surface) -> *mut SDL_Surface;
}
extern "C" {
    pub fn SDL_DisplayFormatAlpha(surface: *mut SDL_Surface) -> *mut SDL_Surface;
}
extern "C" {
    pub fn SDL_CreateYUVOverlay(
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
        format: Uint32,
        display: *mut SDL_Surface,
    ) -> *mut SDL_Overlay;
}
extern "C" {
    pub fn SDL_LockYUVOverlay(overlay: *mut SDL_Overlay) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_UnlockYUVOverlay(overlay: *mut SDL_Overlay);
}
extern "C" {
    pub fn SDL_DisplayYUVOverlay(
        overlay: *mut SDL_Overlay,
        dstrect: *mut SDL_Rect,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_FreeYUVOverlay(overlay: *mut SDL_Overlay);
}
extern "C" {
    pub fn SDL_GL_LoadLibrary(path: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_GL_GetProcAddress(
        proc_: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn SDL_GL_SetAttribute(
        attr: SDL_GLattr,
        value: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_GL_GetAttribute(
        attr: SDL_GLattr,
        value: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_GL_SwapBuffers();
}
extern "C" {
    pub fn SDL_GL_UpdateRects(numrects: ::std::os::raw::c_int, rects: *mut SDL_Rect);
}
extern "C" {
    pub fn SDL_GL_Lock();
}
extern "C" {
    pub fn SDL_GL_Unlock();
}
extern "C" {
    pub fn SDL_WM_SetCaption(
        title: *const ::std::os::raw::c_char,
        icon: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn SDL_WM_GetCaption(
        title: *mut *mut ::std::os::raw::c_char,
        icon: *mut *mut ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn SDL_WM_SetIcon(icon: *mut SDL_Surface, mask: *mut Uint8);
}
extern "C" {
    pub fn SDL_WM_IconifyWindow() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_WM_ToggleFullScreen(surface: *mut SDL_Surface) -> ::std::os::raw::c_int;
}
pub const SDL_GrabMode_SDL_GRAB_QUERY: SDL_GrabMode = -1;
pub const SDL_GrabMode_SDL_GRAB_OFF: SDL_GrabMode = 0;
pub const SDL_GrabMode_SDL_GRAB_ON: SDL_GrabMode = 1;
pub const SDL_GrabMode_SDL_GRAB_FULLSCREEN: SDL_GrabMode = 2;
pub type SDL_GrabMode = ::std::os::raw::c_int;
extern "C" {
    pub fn SDL_WM_GrabInput(mode: SDL_GrabMode) -> SDL_GrabMode;
}
extern "C" {
    pub fn SDL_SoftStretch(
        src: *mut SDL_Surface,
        srcrect: *mut SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *mut SDL_Rect,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WMcursor {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_Cursor {
    pub area: SDL_Rect,
    pub hot_x: Sint16,
    pub hot_y: Sint16,
    pub data: *mut Uint8,
    pub mask: *mut Uint8,
    pub save: [*mut Uint8; 2usize],
    pub wm_cursor: *mut WMcursor,
}
#[test]
fn bindgen_test_layout_SDL_Cursor() {
    assert_eq!(
        ::std::mem::size_of::<SDL_Cursor>(),
        56usize,
        concat!("Size of: ", stringify!(SDL_Cursor))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_Cursor>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_Cursor))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Cursor>())).area as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Cursor),
            "::",
            stringify!(area)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Cursor>())).hot_x as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Cursor),
            "::",
            stringify!(hot_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Cursor>())).hot_y as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Cursor),
            "::",
            stringify!(hot_y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Cursor>())).data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Cursor),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Cursor>())).mask as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Cursor),
            "::",
            stringify!(mask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Cursor>())).save as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Cursor),
            "::",
            stringify!(save)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Cursor>())).wm_cursor as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Cursor),
            "::",
            stringify!(wm_cursor)
        )
    );
}
impl Default for SDL_Cursor {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub fn SDL_GetMouseState(x: *mut ::std::os::raw::c_int, y: *mut ::std::os::raw::c_int)
        -> Uint8;
}
extern "C" {
    pub fn SDL_GetRelativeMouseState(
        x: *mut ::std::os::raw::c_int,
        y: *mut ::std::os::raw::c_int,
    ) -> Uint8;
}
extern "C" {
    pub fn SDL_WarpMouse(x: Uint16, y: Uint16);
}
extern "C" {
    pub fn SDL_CreateCursor(
        data: *mut Uint8,
        mask: *mut Uint8,
        w: ::std::os::raw::c_int,
        h: ::std::os::raw::c_int,
        hot_x: ::std::os::raw::c_int,
        hot_y: ::std::os::raw::c_int,
    ) -> *mut SDL_Cursor;
}
extern "C" {
    pub fn SDL_SetCursor(cursor: *mut SDL_Cursor);
}
extern "C" {
    pub fn SDL_GetCursor() -> *mut SDL_Cursor;
}
extern "C" {
    pub fn SDL_FreeCursor(cursor: *mut SDL_Cursor);
}
extern "C" {
    pub fn SDL_ShowCursor(toggle: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SDL_Joystick {
    _unused: [u8; 0],
}
pub type SDL_Joystick = _SDL_Joystick;
extern "C" {
    pub fn SDL_NumJoysticks() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_JoystickName(device_index: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn SDL_JoystickOpen(device_index: ::std::os::raw::c_int) -> *mut SDL_Joystick;
}
extern "C" {
    pub fn SDL_JoystickOpened(device_index: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_JoystickIndex(joystick: *mut SDL_Joystick) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_JoystickNumAxes(joystick: *mut SDL_Joystick) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_JoystickNumBalls(joystick: *mut SDL_Joystick) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_JoystickNumHats(joystick: *mut SDL_Joystick) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_JoystickNumButtons(joystick: *mut SDL_Joystick) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_JoystickUpdate();
}
extern "C" {
    pub fn SDL_JoystickEventState(state: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_JoystickGetAxis(joystick: *mut SDL_Joystick, axis: ::std::os::raw::c_int) -> Sint16;
}
extern "C" {
    pub fn SDL_JoystickGetHat(joystick: *mut SDL_Joystick, hat: ::std::os::raw::c_int) -> Uint8;
}
extern "C" {
    pub fn SDL_JoystickGetBall(
        joystick: *mut SDL_Joystick,
        ball: ::std::os::raw::c_int,
        dx: *mut ::std::os::raw::c_int,
        dy: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_JoystickGetButton(
        joystick: *mut SDL_Joystick,
        button: ::std::os::raw::c_int,
    ) -> Uint8;
}
extern "C" {
    pub fn SDL_JoystickClose(joystick: *mut SDL_Joystick);
}
pub const SDL_EventType_SDL_NOEVENT: SDL_EventType = 0;
pub const SDL_EventType_SDL_ACTIVEEVENT: SDL_EventType = 1;
pub const SDL_EventType_SDL_KEYDOWN: SDL_EventType = 2;
pub const SDL_EventType_SDL_KEYUP: SDL_EventType = 3;
pub const SDL_EventType_SDL_MOUSEMOTION: SDL_EventType = 4;
pub const SDL_EventType_SDL_MOUSEBUTTONDOWN: SDL_EventType = 5;
pub const SDL_EventType_SDL_MOUSEBUTTONUP: SDL_EventType = 6;
pub const SDL_EventType_SDL_JOYAXISMOTION: SDL_EventType = 7;
pub const SDL_EventType_SDL_JOYBALLMOTION: SDL_EventType = 8;
pub const SDL_EventType_SDL_JOYHATMOTION: SDL_EventType = 9;
pub const SDL_EventType_SDL_JOYBUTTONDOWN: SDL_EventType = 10;
pub const SDL_EventType_SDL_JOYBUTTONUP: SDL_EventType = 11;
pub const SDL_EventType_SDL_QUIT: SDL_EventType = 12;
pub const SDL_EventType_SDL_SYSWMEVENT: SDL_EventType = 13;
pub const SDL_EventType_SDL_EVENT_RESERVEDA: SDL_EventType = 14;
pub const SDL_EventType_SDL_EVENT_RESERVEDB: SDL_EventType = 15;
pub const SDL_EventType_SDL_VIDEORESIZE: SDL_EventType = 16;
pub const SDL_EventType_SDL_VIDEOEXPOSE: SDL_EventType = 17;
pub const SDL_EventType_SDL_EVENT_RESERVED2: SDL_EventType = 18;
pub const SDL_EventType_SDL_EVENT_RESERVED3: SDL_EventType = 19;
pub const SDL_EventType_SDL_EVENT_RESERVED4: SDL_EventType = 20;
pub const SDL_EventType_SDL_EVENT_RESERVED5: SDL_EventType = 21;
pub const SDL_EventType_SDL_EVENT_RESERVED6: SDL_EventType = 22;
pub const SDL_EventType_SDL_EVENT_RESERVED7: SDL_EventType = 23;
pub const SDL_EventType_SDL_USEREVENT: SDL_EventType = 24;
pub const SDL_EventType_SDL_NUMEVENTS: SDL_EventType = 32;
pub type SDL_EventType = ::std::os::raw::c_uint;
pub const SDL_EventMask_SDL_ACTIVEEVENTMASK: SDL_EventMask = 2;
pub const SDL_EventMask_SDL_KEYDOWNMASK: SDL_EventMask = 4;
pub const SDL_EventMask_SDL_KEYUPMASK: SDL_EventMask = 8;
pub const SDL_EventMask_SDL_KEYEVENTMASK: SDL_EventMask = 12;
pub const SDL_EventMask_SDL_MOUSEMOTIONMASK: SDL_EventMask = 16;
pub const SDL_EventMask_SDL_MOUSEBUTTONDOWNMASK: SDL_EventMask = 32;
pub const SDL_EventMask_SDL_MOUSEBUTTONUPMASK: SDL_EventMask = 64;
pub const SDL_EventMask_SDL_MOUSEEVENTMASK: SDL_EventMask = 112;
pub const SDL_EventMask_SDL_JOYAXISMOTIONMASK: SDL_EventMask = 128;
pub const SDL_EventMask_SDL_JOYBALLMOTIONMASK: SDL_EventMask = 256;
pub const SDL_EventMask_SDL_JOYHATMOTIONMASK: SDL_EventMask = 512;
pub const SDL_EventMask_SDL_JOYBUTTONDOWNMASK: SDL_EventMask = 1024;
pub const SDL_EventMask_SDL_JOYBUTTONUPMASK: SDL_EventMask = 2048;
pub const SDL_EventMask_SDL_JOYEVENTMASK: SDL_EventMask = 3968;
pub const SDL_EventMask_SDL_VIDEORESIZEMASK: SDL_EventMask = 65536;
pub const SDL_EventMask_SDL_VIDEOEXPOSEMASK: SDL_EventMask = 131072;
pub const SDL_EventMask_SDL_QUITMASK: SDL_EventMask = 4096;
pub const SDL_EventMask_SDL_SYSWMEVENTMASK: SDL_EventMask = 8192;
pub type SDL_EventMask = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SDL_ActiveEvent {
    pub type_: Uint8,
    pub gain: Uint8,
    pub state: Uint8,
}
#[test]
fn bindgen_test_layout_SDL_ActiveEvent() {
    assert_eq!(
        ::std::mem::size_of::<SDL_ActiveEvent>(),
        3usize,
        concat!("Size of: ", stringify!(SDL_ActiveEvent))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_ActiveEvent>(),
        1usize,
        concat!("Alignment of ", stringify!(SDL_ActiveEvent))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_ActiveEvent>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_ActiveEvent),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_ActiveEvent>())).gain as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_ActiveEvent),
            "::",
            stringify!(gain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_ActiveEvent>())).state as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_ActiveEvent),
            "::",
            stringify!(state)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_KeyboardEvent {
    pub type_: Uint8,
    pub which: Uint8,
    pub state: Uint8,
    pub keysym: SDL_keysym,
}
#[test]
fn bindgen_test_layout_SDL_KeyboardEvent() {
    assert_eq!(
        ::std::mem::size_of::<SDL_KeyboardEvent>(),
        20usize,
        concat!("Size of: ", stringify!(SDL_KeyboardEvent))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_KeyboardEvent>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_KeyboardEvent))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_KeyboardEvent>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_KeyboardEvent),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_KeyboardEvent>())).which as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_KeyboardEvent),
            "::",
            stringify!(which)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_KeyboardEvent>())).state as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_KeyboardEvent),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_KeyboardEvent>())).keysym as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_KeyboardEvent),
            "::",
            stringify!(keysym)
        )
    );
}
impl Default for SDL_KeyboardEvent {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SDL_MouseMotionEvent {
    pub type_: Uint8,
    pub which: Uint8,
    pub state: Uint8,
    pub x: Uint16,
    pub y: Uint16,
    pub xrel: Sint16,
    pub yrel: Sint16,
}
#[test]
fn bindgen_test_layout_SDL_MouseMotionEvent() {
    assert_eq!(
        ::std::mem::size_of::<SDL_MouseMotionEvent>(),
        12usize,
        concat!("Size of: ", stringify!(SDL_MouseMotionEvent))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_MouseMotionEvent>(),
        2usize,
        concat!("Alignment of ", stringify!(SDL_MouseMotionEvent))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_MouseMotionEvent>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_MouseMotionEvent),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_MouseMotionEvent>())).which as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_MouseMotionEvent),
            "::",
            stringify!(which)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_MouseMotionEvent>())).state as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_MouseMotionEvent),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_MouseMotionEvent>())).x as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_MouseMotionEvent),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_MouseMotionEvent>())).y as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_MouseMotionEvent),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_MouseMotionEvent>())).xrel as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_MouseMotionEvent),
            "::",
            stringify!(xrel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_MouseMotionEvent>())).yrel as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_MouseMotionEvent),
            "::",
            stringify!(yrel)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SDL_MouseButtonEvent {
    pub type_: Uint8,
    pub which: Uint8,
    pub button: Uint8,
    pub state: Uint8,
    pub x: Uint16,
    pub y: Uint16,
}
#[test]
fn bindgen_test_layout_SDL_MouseButtonEvent() {
    assert_eq!(
        ::std::mem::size_of::<SDL_MouseButtonEvent>(),
        8usize,
        concat!("Size of: ", stringify!(SDL_MouseButtonEvent))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_MouseButtonEvent>(),
        2usize,
        concat!("Alignment of ", stringify!(SDL_MouseButtonEvent))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_MouseButtonEvent>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_MouseButtonEvent),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_MouseButtonEvent>())).which as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_MouseButtonEvent),
            "::",
            stringify!(which)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_MouseButtonEvent>())).button as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_MouseButtonEvent),
            "::",
            stringify!(button)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_MouseButtonEvent>())).state as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_MouseButtonEvent),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_MouseButtonEvent>())).x as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_MouseButtonEvent),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_MouseButtonEvent>())).y as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_MouseButtonEvent),
            "::",
            stringify!(y)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SDL_JoyAxisEvent {
    pub type_: Uint8,
    pub which: Uint8,
    pub axis: Uint8,
    pub value: Sint16,
}
#[test]
fn bindgen_test_layout_SDL_JoyAxisEvent() {
    assert_eq!(
        ::std::mem::size_of::<SDL_JoyAxisEvent>(),
        6usize,
        concat!("Size of: ", stringify!(SDL_JoyAxisEvent))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_JoyAxisEvent>(),
        2usize,
        concat!("Alignment of ", stringify!(SDL_JoyAxisEvent))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_JoyAxisEvent>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_JoyAxisEvent),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_JoyAxisEvent>())).which as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_JoyAxisEvent),
            "::",
            stringify!(which)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_JoyAxisEvent>())).axis as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_JoyAxisEvent),
            "::",
            stringify!(axis)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_JoyAxisEvent>())).value as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_JoyAxisEvent),
            "::",
            stringify!(value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SDL_JoyBallEvent {
    pub type_: Uint8,
    pub which: Uint8,
    pub ball: Uint8,
    pub xrel: Sint16,
    pub yrel: Sint16,
}
#[test]
fn bindgen_test_layout_SDL_JoyBallEvent() {
    assert_eq!(
        ::std::mem::size_of::<SDL_JoyBallEvent>(),
        8usize,
        concat!("Size of: ", stringify!(SDL_JoyBallEvent))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_JoyBallEvent>(),
        2usize,
        concat!("Alignment of ", stringify!(SDL_JoyBallEvent))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_JoyBallEvent>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_JoyBallEvent),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_JoyBallEvent>())).which as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_JoyBallEvent),
            "::",
            stringify!(which)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_JoyBallEvent>())).ball as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_JoyBallEvent),
            "::",
            stringify!(ball)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_JoyBallEvent>())).xrel as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_JoyBallEvent),
            "::",
            stringify!(xrel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_JoyBallEvent>())).yrel as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_JoyBallEvent),
            "::",
            stringify!(yrel)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SDL_JoyHatEvent {
    pub type_: Uint8,
    pub which: Uint8,
    pub hat: Uint8,
    pub value: Uint8,
}
#[test]
fn bindgen_test_layout_SDL_JoyHatEvent() {
    assert_eq!(
        ::std::mem::size_of::<SDL_JoyHatEvent>(),
        4usize,
        concat!("Size of: ", stringify!(SDL_JoyHatEvent))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_JoyHatEvent>(),
        1usize,
        concat!("Alignment of ", stringify!(SDL_JoyHatEvent))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_JoyHatEvent>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_JoyHatEvent),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_JoyHatEvent>())).which as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_JoyHatEvent),
            "::",
            stringify!(which)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_JoyHatEvent>())).hat as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_JoyHatEvent),
            "::",
            stringify!(hat)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_JoyHatEvent>())).value as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_JoyHatEvent),
            "::",
            stringify!(value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SDL_JoyButtonEvent {
    pub type_: Uint8,
    pub which: Uint8,
    pub button: Uint8,
    pub state: Uint8,
}
#[test]
fn bindgen_test_layout_SDL_JoyButtonEvent() {
    assert_eq!(
        ::std::mem::size_of::<SDL_JoyButtonEvent>(),
        4usize,
        concat!("Size of: ", stringify!(SDL_JoyButtonEvent))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_JoyButtonEvent>(),
        1usize,
        concat!("Alignment of ", stringify!(SDL_JoyButtonEvent))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_JoyButtonEvent>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_JoyButtonEvent),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_JoyButtonEvent>())).which as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_JoyButtonEvent),
            "::",
            stringify!(which)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_JoyButtonEvent>())).button as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_JoyButtonEvent),
            "::",
            stringify!(button)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_JoyButtonEvent>())).state as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_JoyButtonEvent),
            "::",
            stringify!(state)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SDL_ResizeEvent {
    pub type_: Uint8,
    pub w: ::std::os::raw::c_int,
    pub h: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_SDL_ResizeEvent() {
    assert_eq!(
        ::std::mem::size_of::<SDL_ResizeEvent>(),
        12usize,
        concat!("Size of: ", stringify!(SDL_ResizeEvent))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_ResizeEvent>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_ResizeEvent))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_ResizeEvent>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_ResizeEvent),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_ResizeEvent>())).w as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_ResizeEvent),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_ResizeEvent>())).h as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_ResizeEvent),
            "::",
            stringify!(h)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SDL_ExposeEvent {
    pub type_: Uint8,
}
#[test]
fn bindgen_test_layout_SDL_ExposeEvent() {
    assert_eq!(
        ::std::mem::size_of::<SDL_ExposeEvent>(),
        1usize,
        concat!("Size of: ", stringify!(SDL_ExposeEvent))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_ExposeEvent>(),
        1usize,
        concat!("Alignment of ", stringify!(SDL_ExposeEvent))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_ExposeEvent>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_ExposeEvent),
            "::",
            stringify!(type_)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SDL_QuitEvent {
    pub type_: Uint8,
}
#[test]
fn bindgen_test_layout_SDL_QuitEvent() {
    assert_eq!(
        ::std::mem::size_of::<SDL_QuitEvent>(),
        1usize,
        concat!("Size of: ", stringify!(SDL_QuitEvent))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_QuitEvent>(),
        1usize,
        concat!("Alignment of ", stringify!(SDL_QuitEvent))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_QuitEvent>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_QuitEvent),
            "::",
            stringify!(type_)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_UserEvent {
    pub type_: Uint8,
    pub code: ::std::os::raw::c_int,
    pub data1: *mut ::std::os::raw::c_void,
    pub data2: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_SDL_UserEvent() {
    assert_eq!(
        ::std::mem::size_of::<SDL_UserEvent>(),
        24usize,
        concat!("Size of: ", stringify!(SDL_UserEvent))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_UserEvent>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_UserEvent))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_UserEvent>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_UserEvent),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_UserEvent>())).code as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_UserEvent),
            "::",
            stringify!(code)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_UserEvent>())).data1 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_UserEvent),
            "::",
            stringify!(data1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_UserEvent>())).data2 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_UserEvent),
            "::",
            stringify!(data2)
        )
    );
}
impl Default for SDL_UserEvent {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_SysWMmsg {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_SysWMEvent {
    pub type_: Uint8,
    pub msg: *mut SDL_SysWMmsg,
}
#[test]
fn bindgen_test_layout_SDL_SysWMEvent() {
    assert_eq!(
        ::std::mem::size_of::<SDL_SysWMEvent>(),
        16usize,
        concat!("Size of: ", stringify!(SDL_SysWMEvent))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_SysWMEvent>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_SysWMEvent))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_SysWMEvent>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_SysWMEvent),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_SysWMEvent>())).msg as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_SysWMEvent),
            "::",
            stringify!(msg)
        )
    );
}
impl Default for SDL_SysWMEvent {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union SDL_Event {
    pub type_: Uint8,
    pub active: SDL_ActiveEvent,
    pub key: SDL_KeyboardEvent,
    pub motion: SDL_MouseMotionEvent,
    pub button: SDL_MouseButtonEvent,
    pub jaxis: SDL_JoyAxisEvent,
    pub jball: SDL_JoyBallEvent,
    pub jhat: SDL_JoyHatEvent,
    pub jbutton: SDL_JoyButtonEvent,
    pub resize: SDL_ResizeEvent,
    pub expose: SDL_ExposeEvent,
    pub quit: SDL_QuitEvent,
    pub user: SDL_UserEvent,
    pub syswm: SDL_SysWMEvent,
    _bindgen_union_align: [u64; 3usize],
}
#[test]
fn bindgen_test_layout_SDL_Event() {
    assert_eq!(
        ::std::mem::size_of::<SDL_Event>(),
        24usize,
        concat!("Size of: ", stringify!(SDL_Event))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_Event>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_Event))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Event>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Event),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Event>())).active as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Event),
            "::",
            stringify!(active)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Event>())).key as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Event),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Event>())).motion as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Event),
            "::",
            stringify!(motion)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Event>())).button as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Event),
            "::",
            stringify!(button)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Event>())).jaxis as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Event),
            "::",
            stringify!(jaxis)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Event>())).jball as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Event),
            "::",
            stringify!(jball)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Event>())).jhat as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Event),
            "::",
            stringify!(jhat)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Event>())).jbutton as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Event),
            "::",
            stringify!(jbutton)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Event>())).resize as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Event),
            "::",
            stringify!(resize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Event>())).expose as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Event),
            "::",
            stringify!(expose)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Event>())).quit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Event),
            "::",
            stringify!(quit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Event>())).user as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Event),
            "::",
            stringify!(user)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Event>())).syswm as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Event),
            "::",
            stringify!(syswm)
        )
    );
}
impl Default for SDL_Event {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub fn SDL_PumpEvents();
}
pub const SDL_eventaction_SDL_ADDEVENT: SDL_eventaction = 0;
pub const SDL_eventaction_SDL_PEEKEVENT: SDL_eventaction = 1;
pub const SDL_eventaction_SDL_GETEVENT: SDL_eventaction = 2;
pub type SDL_eventaction = ::std::os::raw::c_uint;
extern "C" {
    pub fn SDL_PeepEvents(
        events: *mut SDL_Event,
        numevents: ::std::os::raw::c_int,
        action: SDL_eventaction,
        mask: Uint32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_PollEvent(event: *mut SDL_Event) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_WaitEvent(event: *mut SDL_Event) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_PushEvent(event: *mut SDL_Event) -> ::std::os::raw::c_int;
}
pub type SDL_EventFilter =
    ::std::option::Option<unsafe extern "C" fn(event: *const SDL_Event) -> ::std::os::raw::c_int>;
extern "C" {
    pub fn SDL_SetEventFilter(filter: SDL_EventFilter);
}
extern "C" {
    pub fn SDL_GetEventFilter() -> SDL_EventFilter;
}
extern "C" {
    pub fn SDL_EventState(type_: Uint8, state: ::std::os::raw::c_int) -> Uint8;
}
extern "C" {
    pub fn SDL_LoadObject(sofile: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn SDL_LoadFunction(
        handle: *mut ::std::os::raw::c_void,
        name: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn SDL_UnloadObject(handle: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn SDL_GetTicks() -> Uint32;
}
extern "C" {
    pub fn SDL_Delay(ms: Uint32);
}
pub type SDL_TimerCallback =
    ::std::option::Option<unsafe extern "C" fn(interval: Uint32) -> Uint32>;
extern "C" {
    pub fn SDL_SetTimer(interval: Uint32, callback: SDL_TimerCallback) -> ::std::os::raw::c_int;
}
pub type SDL_NewTimerCallback = ::std::option::Option<
    unsafe extern "C" fn(interval: Uint32, param: *mut ::std::os::raw::c_void) -> Uint32,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SDL_TimerID {
    _unused: [u8; 0],
}
pub type SDL_TimerID = *mut _SDL_TimerID;
extern "C" {
    pub fn SDL_AddTimer(
        interval: Uint32,
        callback: SDL_NewTimerCallback,
        param: *mut ::std::os::raw::c_void,
    ) -> SDL_TimerID;
}
extern "C" {
    pub fn SDL_RemoveTimer(t: SDL_TimerID) -> SDL_bool;
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SDL_version {
    pub major: Uint8,
    pub minor: Uint8,
    pub patch: Uint8,
}
#[test]
fn bindgen_test_layout_SDL_version() {
    assert_eq!(
        ::std::mem::size_of::<SDL_version>(),
        3usize,
        concat!("Size of: ", stringify!(SDL_version))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_version>(),
        1usize,
        concat!("Alignment of ", stringify!(SDL_version))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_version>())).major as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_version),
            "::",
            stringify!(major)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_version>())).minor as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_version),
            "::",
            stringify!(minor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_version>())).patch as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_version),
            "::",
            stringify!(patch)
        )
    );
}
extern "C" {
    pub fn SDL_Linked_Version() -> *const SDL_version;
}
extern "C" {
    pub fn SDL_Init(flags: Uint32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_InitSubSystem(flags: Uint32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_QuitSubSystem(flags: Uint32);
}
extern "C" {
    pub fn SDL_WasInit(flags: Uint32) -> Uint32;
}
extern "C" {
    pub fn SDL_Quit();
}
pub type byte = ::std::os::raw::c_uchar;
pub type INT16 = ::std::os::raw::c_short;
pub type UINT16 = ::std::os::raw::c_ushort;
pub type INT32 = ::std::os::raw::c_int;
pub type UINT32 = ::std::os::raw::c_uint;
#[doc = " @ingroup access_time_local"]
#[doc = "Structure to hold msec and usec."]
#[doc = "\\sa current_micro"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct MICRO {
    pub msec: INT32,
    pub usec: INT16,
}
#[test]
fn bindgen_test_layout_MICRO() {
    assert_eq!(
        ::std::mem::size_of::<MICRO>(),
        8usize,
        concat!("Size of: ", stringify!(MICRO))
    );
    assert_eq!(
        ::std::mem::align_of::<MICRO>(),
        4usize,
        concat!("Alignment of ", stringify!(MICRO))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MICRO>())).msec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MICRO),
            "::",
            stringify!(msec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MICRO>())).usec as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MICRO),
            "::",
            stringify!(usec)
        )
    );
}
#[doc = " @ingroup messaging"]
#[doc = "\\brief Integer sample data"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ISAMPLE {
    #[doc = "< time of sample"]
    pub time: UINT32,
    #[doc = "< always SAMPLE_TYPE"]
    pub type_: INT16,
    #[doc = "< flags to indicate contents"]
    pub flags: UINT16,
    #[doc = "< pupil x"]
    pub px: [INT16; 2usize],
    #[doc = "< pupil y"]
    pub py: [INT16; 2usize],
    #[doc = "< headref x"]
    pub hx: [INT16; 2usize],
    #[doc = "< headref y"]
    pub hy: [INT16; 2usize],
    #[doc = "< pupil size or area"]
    pub pa: [UINT16; 2usize],
    #[doc = "< screen gaze x"]
    pub gx: [INT16; 2usize],
    #[doc = "< screen gaze y"]
    pub gy: [INT16; 2usize],
    #[doc = "< screen pixels per degree"]
    pub rx: INT16,
    #[doc = "< screen pixels per degree"]
    pub ry: INT16,
    #[doc = "< tracker status flags"]
    pub status: UINT16,
    #[doc = "< extra (input word)"]
    pub input: UINT16,
    #[doc = "< button state & changes"]
    pub buttons: UINT16,
    #[doc = "< head-tracker data type (0=none)"]
    pub htype: INT16,
    #[doc = "< head-tracker data"]
    pub hdata: [INT16; 8usize],
}
#[test]
fn bindgen_test_layout_ISAMPLE() {
    assert_eq!(
        ::std::mem::size_of::<ISAMPLE>(),
        64usize,
        concat!("Size of: ", stringify!(ISAMPLE))
    );
    assert_eq!(
        ::std::mem::align_of::<ISAMPLE>(),
        4usize,
        concat!("Alignment of ", stringify!(ISAMPLE))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ISAMPLE>())).time as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ISAMPLE),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ISAMPLE>())).type_ as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ISAMPLE),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ISAMPLE>())).flags as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(ISAMPLE),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ISAMPLE>())).px as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ISAMPLE),
            "::",
            stringify!(px)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ISAMPLE>())).py as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ISAMPLE),
            "::",
            stringify!(py)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ISAMPLE>())).hx as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ISAMPLE),
            "::",
            stringify!(hx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ISAMPLE>())).hy as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ISAMPLE),
            "::",
            stringify!(hy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ISAMPLE>())).pa as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ISAMPLE),
            "::",
            stringify!(pa)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ISAMPLE>())).gx as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ISAMPLE),
            "::",
            stringify!(gx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ISAMPLE>())).gy as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ISAMPLE),
            "::",
            stringify!(gy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ISAMPLE>())).rx as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ISAMPLE),
            "::",
            stringify!(rx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ISAMPLE>())).ry as *const _ as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(ISAMPLE),
            "::",
            stringify!(ry)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ISAMPLE>())).status as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ISAMPLE),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ISAMPLE>())).input as *const _ as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(ISAMPLE),
            "::",
            stringify!(input)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ISAMPLE>())).buttons as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ISAMPLE),
            "::",
            stringify!(buttons)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ISAMPLE>())).htype as *const _ as usize },
        46usize,
        concat!(
            "Offset of field: ",
            stringify!(ISAMPLE),
            "::",
            stringify!(htype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ISAMPLE>())).hdata as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ISAMPLE),
            "::",
            stringify!(hdata)
        )
    );
}
#[doc = " @ingroup messaging"]
#[doc = "\\brief Floating-point sample"]
#[doc = ""]
#[doc = "The EyeLink tracker measures eye position 250, 500, 1000 or 2000 times per second depending on"]
#[doc = "the tracking mode you are working with, and computes true gaze position on the display"]
#[doc = "using the head camera data. This data is stored in the EDF file, and made available"]
#[doc = "through the link in as little as 3 milliseconds after a physical eye movement."]
#[doc = "Samples can be read from the link by eyelink_get_float_data() or eyelink_newest_float_sample()."]
#[doc = ""]
#[doc = "If sample rate is 2000hz, two samples with same time stamp possible. If SAMPLE_ADD_OFFSET is set on the"]
#[doc = "flags, add .5 ms to get the real time. Convenient FLOAT_TIME can also be used."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct FSAMPLE {
    #[doc = "< time of sample"]
    pub time: UINT32,
    #[doc = "< always SAMPLE_TYPE"]
    pub type_: INT16,
    #[doc = "< flags to indicate contents"]
    pub flags: UINT16,
    #[doc = "< pupil x"]
    pub px: [f32; 2usize],
    #[doc = "< pupil y"]
    pub py: [f32; 2usize],
    #[doc = "< headref x"]
    pub hx: [f32; 2usize],
    #[doc = "< headref y"]
    pub hy: [f32; 2usize],
    #[doc = "< pupil size or area"]
    pub pa: [f32; 2usize],
    #[doc = "< screen gaze x"]
    pub gx: [f32; 2usize],
    #[doc = "< screen gaze y"]
    pub gy: [f32; 2usize],
    #[doc = "< screen pixels per degree"]
    pub rx: f32,
    #[doc = "< screen pixels per degree"]
    pub ry: f32,
    #[doc = "< tracker status flags"]
    pub status: UINT16,
    #[doc = "< extra (input word)"]
    pub input: UINT16,
    #[doc = "< button state & changes"]
    pub buttons: UINT16,
    #[doc = "< head-tracker data type (0=none)"]
    pub htype: INT16,
    #[doc = "< head-tracker data (not prescaled)"]
    pub hdata: [INT16; 8usize],
}
#[test]
fn bindgen_test_layout_FSAMPLE() {
    assert_eq!(
        ::std::mem::size_of::<FSAMPLE>(),
        96usize,
        concat!("Size of: ", stringify!(FSAMPLE))
    );
    assert_eq!(
        ::std::mem::align_of::<FSAMPLE>(),
        4usize,
        concat!("Alignment of ", stringify!(FSAMPLE))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FSAMPLE>())).time as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAMPLE),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FSAMPLE>())).type_ as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAMPLE),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FSAMPLE>())).flags as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAMPLE),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FSAMPLE>())).px as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAMPLE),
            "::",
            stringify!(px)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FSAMPLE>())).py as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAMPLE),
            "::",
            stringify!(py)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FSAMPLE>())).hx as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAMPLE),
            "::",
            stringify!(hx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FSAMPLE>())).hy as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAMPLE),
            "::",
            stringify!(hy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FSAMPLE>())).pa as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAMPLE),
            "::",
            stringify!(pa)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FSAMPLE>())).gx as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAMPLE),
            "::",
            stringify!(gx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FSAMPLE>())).gy as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAMPLE),
            "::",
            stringify!(gy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FSAMPLE>())).rx as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAMPLE),
            "::",
            stringify!(rx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FSAMPLE>())).ry as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAMPLE),
            "::",
            stringify!(ry)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FSAMPLE>())).status as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAMPLE),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FSAMPLE>())).input as *const _ as usize },
        74usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAMPLE),
            "::",
            stringify!(input)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FSAMPLE>())).buttons as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAMPLE),
            "::",
            stringify!(buttons)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FSAMPLE>())).htype as *const _ as usize },
        78usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAMPLE),
            "::",
            stringify!(htype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FSAMPLE>())).hdata as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAMPLE),
            "::",
            stringify!(hdata)
        )
    );
}
#[doc = " @ingroup messaging"]
#[doc = "\\brief Floating-point sample with floating point time"]
#[doc = ""]
#[doc = "The EyeLink tracker measures eye position 250, 500, 1000 or 2000 times per second depending on"]
#[doc = "the tracking mode you are working with, and computes true gaze position on the display"]
#[doc = "using the head camera data. This data is stored in the EDF file, and made available"]
#[doc = "through the link in as little as 3 milliseconds after a physical eye movement."]
#[doc = "Samples can be read from the link by eyelink_get_double_data() or eyelink_newest_double_sample()."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct DSAMPLE {
    #[doc = "< time of sample"]
    pub time: f64,
    #[doc = "< always SAMPLE_TYPE"]
    pub type_: INT16,
    #[doc = "< flags to indicate contents"]
    pub flags: UINT16,
    #[doc = "< pupil x"]
    pub px: [f32; 2usize],
    #[doc = "< pupil y"]
    pub py: [f32; 2usize],
    #[doc = "< headref x"]
    pub hx: [f32; 2usize],
    #[doc = "< headref y"]
    pub hy: [f32; 2usize],
    #[doc = "< pupil size or area"]
    pub pa: [f32; 2usize],
    #[doc = "< screen gaze x"]
    pub gx: [f32; 2usize],
    #[doc = "< screen gaze y"]
    pub gy: [f32; 2usize],
    #[doc = "< screen pixels per degree"]
    pub rx: f32,
    #[doc = "< screen pixels per degree"]
    pub ry: f32,
    #[doc = "< tracker status flags"]
    pub status: UINT16,
    #[doc = "< extra (input word)"]
    pub input: UINT16,
    #[doc = "< button state & changes"]
    pub buttons: UINT16,
    #[doc = "< head-tracker data type (0=none)"]
    pub htype: INT16,
    #[doc = "< head-tracker data (not prescaled)"]
    pub hdata: [INT16; 8usize],
}
#[test]
fn bindgen_test_layout_DSAMPLE() {
    assert_eq!(
        ::std::mem::size_of::<DSAMPLE>(),
        104usize,
        concat!("Size of: ", stringify!(DSAMPLE))
    );
    assert_eq!(
        ::std::mem::align_of::<DSAMPLE>(),
        8usize,
        concat!("Alignment of ", stringify!(DSAMPLE))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DSAMPLE>())).time as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DSAMPLE),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DSAMPLE>())).type_ as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DSAMPLE),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DSAMPLE>())).flags as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(DSAMPLE),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DSAMPLE>())).px as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DSAMPLE),
            "::",
            stringify!(px)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DSAMPLE>())).py as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(DSAMPLE),
            "::",
            stringify!(py)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DSAMPLE>())).hx as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(DSAMPLE),
            "::",
            stringify!(hx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DSAMPLE>())).hy as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(DSAMPLE),
            "::",
            stringify!(hy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DSAMPLE>())).pa as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(DSAMPLE),
            "::",
            stringify!(pa)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DSAMPLE>())).gx as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(DSAMPLE),
            "::",
            stringify!(gx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DSAMPLE>())).gy as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(DSAMPLE),
            "::",
            stringify!(gy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DSAMPLE>())).rx as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(DSAMPLE),
            "::",
            stringify!(rx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DSAMPLE>())).ry as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(DSAMPLE),
            "::",
            stringify!(ry)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DSAMPLE>())).status as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(DSAMPLE),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DSAMPLE>())).input as *const _ as usize },
        78usize,
        concat!(
            "Offset of field: ",
            stringify!(DSAMPLE),
            "::",
            stringify!(input)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DSAMPLE>())).buttons as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(DSAMPLE),
            "::",
            stringify!(buttons)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DSAMPLE>())).htype as *const _ as usize },
        82usize,
        concat!(
            "Offset of field: ",
            stringify!(DSAMPLE),
            "::",
            stringify!(htype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DSAMPLE>())).hdata as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(DSAMPLE),
            "::",
            stringify!(hdata)
        )
    );
}
#[doc = "@internal"]
#[doc = "Used to access raw online data."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct FSAMPLE_RAW {
    pub struct_size: UINT32,
    pub raw_pupil: [f32; 2usize],
    pub raw_cr: [f32; 2usize],
    pub pupil_area: UINT32,
    pub cr_area: UINT32,
    pub pupil_dimension: [UINT32; 2usize],
    pub cr_dimension: [UINT32; 2usize],
    pub window_position: [UINT32; 2usize],
    pub pupil_cr: [f32; 2usize],
    pub cr_area2: UINT32,
    pub raw_cr2: [f32; 2usize],
}
#[test]
fn bindgen_test_layout_FSAMPLE_RAW() {
    assert_eq!(
        ::std::mem::size_of::<FSAMPLE_RAW>(),
        72usize,
        concat!("Size of: ", stringify!(FSAMPLE_RAW))
    );
    assert_eq!(
        ::std::mem::align_of::<FSAMPLE_RAW>(),
        4usize,
        concat!("Alignment of ", stringify!(FSAMPLE_RAW))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FSAMPLE_RAW>())).struct_size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAMPLE_RAW),
            "::",
            stringify!(struct_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FSAMPLE_RAW>())).raw_pupil as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAMPLE_RAW),
            "::",
            stringify!(raw_pupil)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FSAMPLE_RAW>())).raw_cr as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAMPLE_RAW),
            "::",
            stringify!(raw_cr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FSAMPLE_RAW>())).pupil_area as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAMPLE_RAW),
            "::",
            stringify!(pupil_area)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FSAMPLE_RAW>())).cr_area as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAMPLE_RAW),
            "::",
            stringify!(cr_area)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FSAMPLE_RAW>())).pupil_dimension as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAMPLE_RAW),
            "::",
            stringify!(pupil_dimension)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FSAMPLE_RAW>())).cr_dimension as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAMPLE_RAW),
            "::",
            stringify!(cr_dimension)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FSAMPLE_RAW>())).window_position as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAMPLE_RAW),
            "::",
            stringify!(window_position)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FSAMPLE_RAW>())).pupil_cr as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAMPLE_RAW),
            "::",
            stringify!(pupil_cr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FSAMPLE_RAW>())).cr_area2 as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAMPLE_RAW),
            "::",
            stringify!(cr_area2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FSAMPLE_RAW>())).raw_cr2 as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAMPLE_RAW),
            "::",
            stringify!(raw_cr2)
        )
    );
}
#[doc = " @ingroup messaging"]
#[doc = "\\brief Integer eye-movement events"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct IEVENT {
    #[doc = "< effective time of event"]
    pub time: UINT32,
    #[doc = "< event type"]
    pub type_: INT16,
    #[doc = "< flags which items were included"]
    pub read: UINT16,
    #[doc = "< eye: 0=left,1=right"]
    pub eye: INT16,
    #[doc = "< start times"]
    pub sttime: UINT32,
    #[doc = "< end times"]
    pub entime: UINT32,
    #[doc = "< starting point x"]
    pub hstx: INT16,
    #[doc = "< starting point y"]
    pub hsty: INT16,
    #[doc = "< starting point x"]
    pub gstx: INT16,
    #[doc = "< starting point y"]
    pub gsty: INT16,
    pub sta: UINT16,
    #[doc = "< ending point x"]
    pub henx: INT16,
    #[doc = "< ending point y"]
    pub heny: INT16,
    #[doc = "< ending point x"]
    pub genx: INT16,
    #[doc = "< ending point y"]
    pub geny: INT16,
    pub ena: UINT16,
    #[doc = "< average x"]
    pub havx: INT16,
    #[doc = "< average y"]
    pub havy: INT16,
    #[doc = "< average x"]
    pub gavx: INT16,
    #[doc = "< average y"]
    pub gavy: INT16,
    #[doc = "< also used as accumulator"]
    pub ava: UINT16,
    #[doc = "< avg velocity accum"]
    pub avel: INT16,
    #[doc = "< peak velocity accum"]
    pub pvel: INT16,
    #[doc = "< start velocity"]
    pub svel: INT16,
    #[doc = "< end velocity"]
    pub evel: INT16,
    #[doc = "< start units-per-degree x"]
    pub supd_x: INT16,
    #[doc = "< end units-per-degree y"]
    pub eupd_x: INT16,
    #[doc = "< start units-per-degree y"]
    pub supd_y: INT16,
    #[doc = "< end units-per-degree y"]
    pub eupd_y: INT16,
    #[doc = "< error, warning flags"]
    pub status: UINT16,
}
#[test]
fn bindgen_test_layout_IEVENT() {
    assert_eq!(
        ::std::mem::size_of::<IEVENT>(),
        68usize,
        concat!("Size of: ", stringify!(IEVENT))
    );
    assert_eq!(
        ::std::mem::align_of::<IEVENT>(),
        4usize,
        concat!("Alignment of ", stringify!(IEVENT))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IEVENT>())).time as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(IEVENT),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IEVENT>())).type_ as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(IEVENT),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IEVENT>())).read as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(IEVENT),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IEVENT>())).eye as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(IEVENT),
            "::",
            stringify!(eye)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IEVENT>())).sttime as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(IEVENT),
            "::",
            stringify!(sttime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IEVENT>())).entime as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(IEVENT),
            "::",
            stringify!(entime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IEVENT>())).hstx as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(IEVENT),
            "::",
            stringify!(hstx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IEVENT>())).hsty as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(IEVENT),
            "::",
            stringify!(hsty)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IEVENT>())).gstx as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(IEVENT),
            "::",
            stringify!(gstx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IEVENT>())).gsty as *const _ as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(IEVENT),
            "::",
            stringify!(gsty)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IEVENT>())).sta as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(IEVENT),
            "::",
            stringify!(sta)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IEVENT>())).henx as *const _ as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(IEVENT),
            "::",
            stringify!(henx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IEVENT>())).heny as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(IEVENT),
            "::",
            stringify!(heny)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IEVENT>())).genx as *const _ as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(IEVENT),
            "::",
            stringify!(genx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IEVENT>())).geny as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(IEVENT),
            "::",
            stringify!(geny)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IEVENT>())).ena as *const _ as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(IEVENT),
            "::",
            stringify!(ena)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IEVENT>())).havx as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(IEVENT),
            "::",
            stringify!(havx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IEVENT>())).havy as *const _ as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(IEVENT),
            "::",
            stringify!(havy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IEVENT>())).gavx as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(IEVENT),
            "::",
            stringify!(gavx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IEVENT>())).gavy as *const _ as usize },
        46usize,
        concat!(
            "Offset of field: ",
            stringify!(IEVENT),
            "::",
            stringify!(gavy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IEVENT>())).ava as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(IEVENT),
            "::",
            stringify!(ava)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IEVENT>())).avel as *const _ as usize },
        50usize,
        concat!(
            "Offset of field: ",
            stringify!(IEVENT),
            "::",
            stringify!(avel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IEVENT>())).pvel as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(IEVENT),
            "::",
            stringify!(pvel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IEVENT>())).svel as *const _ as usize },
        54usize,
        concat!(
            "Offset of field: ",
            stringify!(IEVENT),
            "::",
            stringify!(svel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IEVENT>())).evel as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(IEVENT),
            "::",
            stringify!(evel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IEVENT>())).supd_x as *const _ as usize },
        58usize,
        concat!(
            "Offset of field: ",
            stringify!(IEVENT),
            "::",
            stringify!(supd_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IEVENT>())).eupd_x as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(IEVENT),
            "::",
            stringify!(eupd_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IEVENT>())).supd_y as *const _ as usize },
        62usize,
        concat!(
            "Offset of field: ",
            stringify!(IEVENT),
            "::",
            stringify!(supd_y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IEVENT>())).eupd_y as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(IEVENT),
            "::",
            stringify!(eupd_y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IEVENT>())).status as *const _ as usize },
        66usize,
        concat!(
            "Offset of field: ",
            stringify!(IEVENT),
            "::",
            stringify!(status)
        )
    );
}
#[doc = "@ingroup messaging"]
#[doc = "\\brief Floating-point eye event"]
#[doc = ""]
#[doc = "The EyeLink tracker analyzes the eye-position samples during recording to"]
#[doc = "detect saccades, and accumulates data on saccades and fixations. Events"]
#[doc = "are produced to mark the start and end of saccades, fixations and blinks."]
#[doc = "When both eyes are being tracked, left and right eye events are produced,"]
#[doc = "as indicated in the eye field of the FEVENT structure."]
#[doc = ""]
#[doc = "Start events contain only the start time, and optionally the start eye"]
#[doc = "or gaze position. End events contain the start and end time, plus summary"]
#[doc = "data on saccades and fixations. This includes start and end and average"]
#[doc = "measures of position and pupil size, plus peak and average velocity in"]
#[doc = "degrees per second."]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct FEVENT {
    #[doc = "< effective time of event"]
    pub time: UINT32,
    #[doc = "< event type"]
    pub type_: INT16,
    #[doc = "< flags which items were included"]
    pub read: UINT16,
    #[doc = "< eye: 0=left,1=right"]
    pub eye: INT16,
    #[doc = "< start times"]
    pub sttime: UINT32,
    #[doc = "< end times"]
    pub entime: UINT32,
    #[doc = "< starting point x"]
    pub hstx: f32,
    #[doc = "< starting point y"]
    pub hsty: f32,
    #[doc = "< starting point x"]
    pub gstx: f32,
    #[doc = "< starting point y"]
    pub gsty: f32,
    #[doc = "< starting area"]
    pub sta: f32,
    #[doc = "< ending point x"]
    pub henx: f32,
    #[doc = "< ending point y"]
    pub heny: f32,
    #[doc = "< ending point x"]
    pub genx: f32,
    #[doc = "< ending point y"]
    pub geny: f32,
    #[doc = "< ending area"]
    pub ena: f32,
    #[doc = "< average x"]
    pub havx: f32,
    #[doc = "< average y"]
    pub havy: f32,
    #[doc = "< average x"]
    pub gavx: f32,
    #[doc = "< average y"]
    pub gavy: f32,
    #[doc = "< average area"]
    pub ava: f32,
    #[doc = "< avg velocity accum"]
    pub avel: f32,
    #[doc = "< peak velocity accum"]
    pub pvel: f32,
    #[doc = "< start velocity"]
    pub svel: f32,
    #[doc = "< end velocity"]
    pub evel: f32,
    #[doc = "< start units-per-degree x"]
    pub supd_x: f32,
    #[doc = "< end units-per-degree x"]
    pub eupd_x: f32,
    #[doc = "< start units-per-degree y"]
    pub supd_y: f32,
    #[doc = "< end units-per-degree y"]
    pub eupd_y: f32,
    #[doc = "< error, warning flags"]
    pub status: UINT16,
}
#[test]
fn bindgen_test_layout_FEVENT() {
    assert_eq!(
        ::std::mem::size_of::<FEVENT>(),
        116usize,
        concat!("Size of: ", stringify!(FEVENT))
    );
    assert_eq!(
        ::std::mem::align_of::<FEVENT>(),
        4usize,
        concat!("Alignment of ", stringify!(FEVENT))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FEVENT>())).time as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FEVENT),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FEVENT>())).type_ as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FEVENT),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FEVENT>())).read as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(FEVENT),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FEVENT>())).eye as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FEVENT),
            "::",
            stringify!(eye)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FEVENT>())).sttime as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FEVENT),
            "::",
            stringify!(sttime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FEVENT>())).entime as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FEVENT),
            "::",
            stringify!(entime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FEVENT>())).hstx as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FEVENT),
            "::",
            stringify!(hstx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FEVENT>())).hsty as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FEVENT),
            "::",
            stringify!(hsty)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FEVENT>())).gstx as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(FEVENT),
            "::",
            stringify!(gstx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FEVENT>())).gsty as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(FEVENT),
            "::",
            stringify!(gsty)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FEVENT>())).sta as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(FEVENT),
            "::",
            stringify!(sta)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FEVENT>())).henx as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(FEVENT),
            "::",
            stringify!(henx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FEVENT>())).heny as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(FEVENT),
            "::",
            stringify!(heny)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FEVENT>())).genx as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(FEVENT),
            "::",
            stringify!(genx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FEVENT>())).geny as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(FEVENT),
            "::",
            stringify!(geny)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FEVENT>())).ena as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(FEVENT),
            "::",
            stringify!(ena)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FEVENT>())).havx as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(FEVENT),
            "::",
            stringify!(havx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FEVENT>())).havy as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(FEVENT),
            "::",
            stringify!(havy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FEVENT>())).gavx as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(FEVENT),
            "::",
            stringify!(gavx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FEVENT>())).gavy as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(FEVENT),
            "::",
            stringify!(gavy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FEVENT>())).ava as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(FEVENT),
            "::",
            stringify!(ava)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FEVENT>())).avel as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(FEVENT),
            "::",
            stringify!(avel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FEVENT>())).pvel as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(FEVENT),
            "::",
            stringify!(pvel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FEVENT>())).svel as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(FEVENT),
            "::",
            stringify!(svel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FEVENT>())).evel as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(FEVENT),
            "::",
            stringify!(evel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FEVENT>())).supd_x as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(FEVENT),
            "::",
            stringify!(supd_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FEVENT>())).eupd_x as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(FEVENT),
            "::",
            stringify!(eupd_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FEVENT>())).supd_y as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(FEVENT),
            "::",
            stringify!(supd_y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FEVENT>())).eupd_y as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(FEVENT),
            "::",
            stringify!(eupd_y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FEVENT>())).status as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(FEVENT),
            "::",
            stringify!(status)
        )
    );
}
#[doc = "@ingroup messaging"]
#[doc = "\\brief Floating-point eye event with floating point time"]
#[doc = ""]
#[doc = "The EyeLink tracker analyzes the eye-position samples during recording to"]
#[doc = "detect saccades, and accumulates data on saccades and fixations. Events"]
#[doc = "are produced to mark the start and end of saccades, fixations and blinks."]
#[doc = "When both eyes are being tracked, left and right eye events are produced,"]
#[doc = "as indicated in the eye field of the FEVENT structure."]
#[doc = ""]
#[doc = "Start events contain only the start time, and optionally the start eye"]
#[doc = "or gaze position. End events contain the start and end time, plus summary"]
#[doc = "data on saccades and fixations. This includes start and end and average"]
#[doc = "measures of position and pupil size, plus peak and average velocity in"]
#[doc = "degrees per second."]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct DEVENT {
    #[doc = "< effective time of event"]
    pub time: f64,
    #[doc = "< event type"]
    pub type_: INT16,
    #[doc = "< flags which items were included"]
    pub read: UINT16,
    #[doc = "< eye: 0=left,1=right"]
    pub eye: INT16,
    #[doc = "< start times"]
    pub sttime: f64,
    #[doc = "< end times"]
    pub entime: f64,
    #[doc = "< starting point x"]
    pub hstx: f32,
    #[doc = "< starting point y"]
    pub hsty: f32,
    #[doc = "< starting point x"]
    pub gstx: f32,
    #[doc = "< starting point y"]
    pub gsty: f32,
    #[doc = "< starting area"]
    pub sta: f32,
    #[doc = "< ending point x"]
    pub henx: f32,
    #[doc = "< ending point y"]
    pub heny: f32,
    #[doc = "< ending point x"]
    pub genx: f32,
    #[doc = "< ending point y"]
    pub geny: f32,
    #[doc = "< ending area"]
    pub ena: f32,
    #[doc = "< average x"]
    pub havx: f32,
    #[doc = "< average y"]
    pub havy: f32,
    #[doc = "< average x"]
    pub gavx: f32,
    #[doc = "< average y"]
    pub gavy: f32,
    #[doc = "< average area"]
    pub ava: f32,
    #[doc = "< avg velocity accum"]
    pub avel: f32,
    #[doc = "< peak velocity accum"]
    pub pvel: f32,
    #[doc = "< start velocity"]
    pub svel: f32,
    #[doc = "< end velocity"]
    pub evel: f32,
    #[doc = "< start units-per-degree x"]
    pub supd_x: f32,
    #[doc = "< end units-per-degree x"]
    pub eupd_x: f32,
    #[doc = "< start units-per-degree y"]
    pub supd_y: f32,
    #[doc = "< end units-per-degree y"]
    pub eupd_y: f32,
    #[doc = "< error, warning flags"]
    pub status: UINT16,
}
#[test]
fn bindgen_test_layout_DEVENT() {
    assert_eq!(
        ::std::mem::size_of::<DEVENT>(),
        128usize,
        concat!("Size of: ", stringify!(DEVENT))
    );
    assert_eq!(
        ::std::mem::align_of::<DEVENT>(),
        8usize,
        concat!("Alignment of ", stringify!(DEVENT))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DEVENT>())).time as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DEVENT),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DEVENT>())).type_ as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DEVENT),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DEVENT>())).read as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(DEVENT),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DEVENT>())).eye as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DEVENT),
            "::",
            stringify!(eye)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DEVENT>())).sttime as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DEVENT),
            "::",
            stringify!(sttime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DEVENT>())).entime as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(DEVENT),
            "::",
            stringify!(entime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DEVENT>())).hstx as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(DEVENT),
            "::",
            stringify!(hstx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DEVENT>())).hsty as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(DEVENT),
            "::",
            stringify!(hsty)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DEVENT>())).gstx as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(DEVENT),
            "::",
            stringify!(gstx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DEVENT>())).gsty as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(DEVENT),
            "::",
            stringify!(gsty)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DEVENT>())).sta as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(DEVENT),
            "::",
            stringify!(sta)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DEVENT>())).henx as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(DEVENT),
            "::",
            stringify!(henx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DEVENT>())).heny as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(DEVENT),
            "::",
            stringify!(heny)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DEVENT>())).genx as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(DEVENT),
            "::",
            stringify!(genx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DEVENT>())).geny as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(DEVENT),
            "::",
            stringify!(geny)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DEVENT>())).ena as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(DEVENT),
            "::",
            stringify!(ena)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DEVENT>())).havx as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(DEVENT),
            "::",
            stringify!(havx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DEVENT>())).havy as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(DEVENT),
            "::",
            stringify!(havy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DEVENT>())).gavx as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(DEVENT),
            "::",
            stringify!(gavx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DEVENT>())).gavy as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(DEVENT),
            "::",
            stringify!(gavy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DEVENT>())).ava as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(DEVENT),
            "::",
            stringify!(ava)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DEVENT>())).avel as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(DEVENT),
            "::",
            stringify!(avel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DEVENT>())).pvel as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(DEVENT),
            "::",
            stringify!(pvel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DEVENT>())).svel as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(DEVENT),
            "::",
            stringify!(svel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DEVENT>())).evel as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(DEVENT),
            "::",
            stringify!(evel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DEVENT>())).supd_x as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(DEVENT),
            "::",
            stringify!(supd_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DEVENT>())).eupd_x as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(DEVENT),
            "::",
            stringify!(eupd_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DEVENT>())).supd_y as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(DEVENT),
            "::",
            stringify!(supd_y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DEVENT>())).eupd_y as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(DEVENT),
            "::",
            stringify!(eupd_y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DEVENT>())).status as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(DEVENT),
            "::",
            stringify!(status)
        )
    );
}
#[doc = "@ingroup messaging"]
#[doc = "\\brief Message events: usually text but may contain binary data"]
#[doc = ""]
#[doc = "A message event is created by your experiment program, and placed in the EDF file."]
#[doc = "It is possible to enable the sending of these messages back through the link,"]
#[doc = "although there is rarely a reason to do this. Although this method might be"]
#[doc = "used to determine the tracker time (the time field of a message event will indicate"]
#[doc = "when the message was received by the tracker), the use of eyelink_request_time()"]
#[doc = "and eyelink_read_time() is more efficient for retrieving the current time from the"]
#[doc = "eye tracker's timestamp clock. The eye tracker time is rarely needed in any case,"]
#[doc = "and would only be useful to compute link transport delays."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct IMESSAGE {
    #[doc = "< time message logged"]
    pub time: UINT32,
    #[doc = "< event type: usually MESSAGEEVENT"]
    pub type_: INT16,
    #[doc = "< length of message"]
    pub length: UINT16,
    #[doc = "< message contents (max length 255)"]
    pub text: [byte; 260usize],
}
#[test]
fn bindgen_test_layout_IMESSAGE() {
    assert_eq!(
        ::std::mem::size_of::<IMESSAGE>(),
        268usize,
        concat!("Size of: ", stringify!(IMESSAGE))
    );
    assert_eq!(
        ::std::mem::align_of::<IMESSAGE>(),
        4usize,
        concat!("Alignment of ", stringify!(IMESSAGE))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IMESSAGE>())).time as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(IMESSAGE),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IMESSAGE>())).type_ as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(IMESSAGE),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IMESSAGE>())).length as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(IMESSAGE),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IMESSAGE>())).text as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(IMESSAGE),
            "::",
            stringify!(text)
        )
    );
}
impl Default for IMESSAGE {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = "@ingroup messaging"]
#[doc = "\\brief Message events: usually text but may contain binary data with floating point time."]
#[doc = ""]
#[doc = "A message event is created by your experiment program, and placed in the EDF file."]
#[doc = "It is possible to enable the sending of these messages back through the link,"]
#[doc = "although there is rarely a reason to do this. Although this method might be"]
#[doc = "used to determine the tracker time (the time field of a message event will indicate"]
#[doc = "when the message was received by the tracker), the use of eyelink_request_time()"]
#[doc = "and eyelink_read_time() is more efficient for retrieving the current time from the"]
#[doc = "eye tracker's timestamp clock. The eye tracker time is rarely needed in any case,"]
#[doc = "and would only be useful to compute link transport delays."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DMESSAGE {
    #[doc = "< time message logged"]
    pub time: f64,
    #[doc = "< event type: usually MESSAGEEVENT"]
    pub type_: INT16,
    #[doc = "< length of message"]
    pub length: UINT16,
    #[doc = "< message contents (max length 255)"]
    pub text: [byte; 260usize],
}
#[test]
fn bindgen_test_layout_DMESSAGE() {
    assert_eq!(
        ::std::mem::size_of::<DMESSAGE>(),
        272usize,
        concat!("Size of: ", stringify!(DMESSAGE))
    );
    assert_eq!(
        ::std::mem::align_of::<DMESSAGE>(),
        8usize,
        concat!("Alignment of ", stringify!(DMESSAGE))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DMESSAGE>())).time as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMESSAGE),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DMESSAGE>())).type_ as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DMESSAGE),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DMESSAGE>())).length as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(DMESSAGE),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DMESSAGE>())).text as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DMESSAGE),
            "::",
            stringify!(text)
        )
    );
}
impl Default for DMESSAGE {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " @ingroup messaging"]
#[doc = "\\brief Button, input, other simple events"]
#[doc = ""]
#[doc = "BUTTONEVENT and INPUTEVENT types are the simplest events, reporting"]
#[doc = "changes in button status or in the input port data. The time field"]
#[doc = "records the timestamp of the eye-data sample where the change occurred,"]
#[doc = "although the event itself is usually sent before that sample. The data"]
#[doc = "field contains the data after the change, in the same format as in the"]
#[doc = "FSAMPLE structure."]
#[doc = ""]
#[doc = "Button events from the link are rarely used; monitoring buttons with one"]
#[doc = "of eyelink_read_keybutton(), eyelink_last_button_press(), or"]
#[doc = "eyelink_button_states() is preferable, since these can report button"]
#[doc = "states at any time, not just during recording."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct IOEVENT {
    #[doc = "< time logged"]
    pub time: UINT32,
    #[doc = "< event type:"]
    pub type_: INT16,
    #[doc = "< coded event data"]
    pub data: UINT16,
}
#[test]
fn bindgen_test_layout_IOEVENT() {
    assert_eq!(
        ::std::mem::size_of::<IOEVENT>(),
        8usize,
        concat!("Size of: ", stringify!(IOEVENT))
    );
    assert_eq!(
        ::std::mem::align_of::<IOEVENT>(),
        4usize,
        concat!("Alignment of ", stringify!(IOEVENT))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IOEVENT>())).time as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(IOEVENT),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IOEVENT>())).type_ as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(IOEVENT),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IOEVENT>())).data as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(IOEVENT),
            "::",
            stringify!(data)
        )
    );
}
#[doc = " @ingroup messaging"]
#[doc = "\\brief Button, input, other simple events with floating point time."]
#[doc = ""]
#[doc = "BUTTONEVENT and INPUTEVENT types are the simplest events, reporting"]
#[doc = "changes in button status or in the input port data. The time field"]
#[doc = "records the timestamp of the eye-data sample where the change occurred,"]
#[doc = "although the event itself is usually sent before that sample. The data"]
#[doc = "field contains the data after the change, in the same format as in the"]
#[doc = "FSAMPLE structure."]
#[doc = ""]
#[doc = "Button events from the link are rarely used; monitoring buttons with one"]
#[doc = "of eyelink_read_keybutton(), eyelink_last_button_press(), or"]
#[doc = "eyelink_button_states() is preferable, since these can report button"]
#[doc = "states at any time, not just during recording."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct DIOEVENT {
    #[doc = "< time logged"]
    pub time: f64,
    #[doc = "< event type:"]
    pub type_: INT16,
    #[doc = "< coded event data"]
    pub data: UINT16,
}
#[test]
fn bindgen_test_layout_DIOEVENT() {
    assert_eq!(
        ::std::mem::size_of::<DIOEVENT>(),
        16usize,
        concat!("Size of: ", stringify!(DIOEVENT))
    );
    assert_eq!(
        ::std::mem::align_of::<DIOEVENT>(),
        8usize,
        concat!("Alignment of ", stringify!(DIOEVENT))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DIOEVENT>())).time as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DIOEVENT),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DIOEVENT>())).type_ as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DIOEVENT),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DIOEVENT>())).data as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(DIOEVENT),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ALL_DATA {
    pub ie: IEVENT,
    pub im: IMESSAGE,
    pub io: IOEVENT,
    pub is: ISAMPLE,
    _bindgen_union_align: [u32; 67usize],
}
#[test]
fn bindgen_test_layout_ALL_DATA() {
    assert_eq!(
        ::std::mem::size_of::<ALL_DATA>(),
        268usize,
        concat!("Size of: ", stringify!(ALL_DATA))
    );
    assert_eq!(
        ::std::mem::align_of::<ALL_DATA>(),
        4usize,
        concat!("Alignment of ", stringify!(ALL_DATA))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ALL_DATA>())).ie as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ALL_DATA),
            "::",
            stringify!(ie)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ALL_DATA>())).im as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ALL_DATA),
            "::",
            stringify!(im)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ALL_DATA>())).io as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ALL_DATA),
            "::",
            stringify!(io)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ALL_DATA>())).is as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ALL_DATA),
            "::",
            stringify!(is)
        )
    );
}
impl Default for ALL_DATA {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " @ingroup messaging"]
#[doc = "\\brief Union of message, io event and float sample and float event."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union ALLF_DATA {
    pub fe: FEVENT,
    pub im: IMESSAGE,
    pub io: IOEVENT,
    pub fs: FSAMPLE,
    _bindgen_union_align: [u32; 67usize],
}
#[test]
fn bindgen_test_layout_ALLF_DATA() {
    assert_eq!(
        ::std::mem::size_of::<ALLF_DATA>(),
        268usize,
        concat!("Size of: ", stringify!(ALLF_DATA))
    );
    assert_eq!(
        ::std::mem::align_of::<ALLF_DATA>(),
        4usize,
        concat!("Alignment of ", stringify!(ALLF_DATA))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ALLF_DATA>())).fe as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ALLF_DATA),
            "::",
            stringify!(fe)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ALLF_DATA>())).im as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ALLF_DATA),
            "::",
            stringify!(im)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ALLF_DATA>())).io as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ALLF_DATA),
            "::",
            stringify!(io)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ALLF_DATA>())).fs as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ALLF_DATA),
            "::",
            stringify!(fs)
        )
    );
}
impl Default for ALLF_DATA {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " @ingroup messaging"]
#[doc = "\\brief Union of message, io event and double sample and double event."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union ALLD_DATA {
    pub fe: DEVENT,
    pub im: DMESSAGE,
    pub io: DIOEVENT,
    pub fs: DSAMPLE,
    _bindgen_union_align: [u64; 34usize],
}
#[test]
fn bindgen_test_layout_ALLD_DATA() {
    assert_eq!(
        ::std::mem::size_of::<ALLD_DATA>(),
        272usize,
        concat!("Size of: ", stringify!(ALLD_DATA))
    );
    assert_eq!(
        ::std::mem::align_of::<ALLD_DATA>(),
        8usize,
        concat!("Alignment of ", stringify!(ALLD_DATA))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ALLD_DATA>())).fe as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ALLD_DATA),
            "::",
            stringify!(fe)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ALLD_DATA>())).im as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ALLD_DATA),
            "::",
            stringify!(im)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ALLD_DATA>())).io as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ALLD_DATA),
            "::",
            stringify!(io)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ALLD_DATA>())).fs as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ALLD_DATA),
            "::",
            stringify!(fs)
        )
    );
}
impl Default for ALLD_DATA {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type ELINKADDR = [byte; 16usize];
#[doc = " \\brief Name and address for connection."]
#[doc = ""]
#[doc = "Name and address for connection or ping"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ELINKNODE {
    #[doc = "< address of the remote  or local tracker"]
    pub addr: ELINKADDR,
    #[doc = "< name of the remote  or local tracker"]
    pub name: [::std::os::raw::c_char; 40usize],
}
#[test]
fn bindgen_test_layout_ELINKNODE() {
    assert_eq!(
        ::std::mem::size_of::<ELINKNODE>(),
        56usize,
        concat!("Size of: ", stringify!(ELINKNODE))
    );
    assert_eq!(
        ::std::mem::align_of::<ELINKNODE>(),
        1usize,
        concat!("Alignment of ", stringify!(ELINKNODE))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ELINKNODE>())).addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ELINKNODE),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ELINKNODE>())).name as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ELINKNODE),
            "::",
            stringify!(name)
        )
    );
}
impl Default for ELINKNODE {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " \\brief Class to represent tracker status."]
#[doc = ""]
#[doc = "Class to represent tracker status information such as time stamps, flags, tracker addresses and so on."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ILINKDATA {
    #[doc = "< time of last control event"]
    pub time: UINT32,
    #[doc = "< structure version"]
    pub version: UINT32,
    #[doc = "< 10*sample rate (0 if no samples, 1 if nonconstant)"]
    pub samrate: UINT16,
    #[doc = "< sample \"divisor\" (min msec between samples)"]
    pub samdiv: UINT16,
    #[doc = "< amount to divide gaze x,y,res by"]
    pub prescaler: UINT16,
    #[doc = "< amount to divide velocity by"]
    pub vprescaler: UINT16,
    #[doc = "< pupil prescale (1 if area, greater if diameter)"]
    pub pprescaler: UINT16,
    #[doc = "< head-distance prescale (to mm)"]
    pub hprescaler: UINT16,
    #[doc = "< 0 if off, else all flags"]
    pub sample_data: UINT16,
    #[doc = "< 0 if off, else all flags"]
    pub event_data: UINT16,
    #[doc = "< 0 if off, else event-type flags"]
    pub event_types: UINT16,
    #[doc = "< set if in block with samples"]
    pub in_sample_block: byte,
    #[doc = "< set if in block with events"]
    pub in_event_block: byte,
    #[doc = "< set if any left-eye data expected"]
    pub have_left_eye: byte,
    #[doc = "< set if any right-eye data expected"]
    pub have_right_eye: byte,
    #[doc = "< flags what we lost before last item"]
    pub last_data_gap_types: UINT16,
    #[doc = "< buffer-type code"]
    pub last_data_buffer_type: UINT16,
    #[doc = "< buffer size of last item"]
    pub last_data_buffer_size: UINT16,
    #[doc = "< set if control event read with last data"]
    pub control_read: UINT16,
    #[doc = "< set if control event started new block"]
    pub first_in_block: UINT16,
    #[doc = "< time field of item"]
    pub last_data_item_time: UINT32,
    #[doc = "< type: 100=sample, 0=none, else event type"]
    pub last_data_item_type: UINT16,
    #[doc = "< content: &lt;read&gt; (IEVENT), &lt;flags&gt; (ISAMPLE)"]
    pub last_data_item_contents: UINT16,
    #[doc = "< buffer containing last item"]
    pub last_data_item: ALL_DATA,
    #[doc = "< block in file"]
    pub block_number: UINT32,
    #[doc = "< samples read in block so far"]
    pub block_sample: UINT32,
    #[doc = "< events (excl. control read in block"]
    pub block_event: UINT32,
    #[doc = "< updated by samples only"]
    pub last_resx: UINT16,
    #[doc = "< updated by samples only"]
    pub last_resy: UINT16,
    #[doc = "< updated by samples only"]
    pub last_pupil: [UINT16; 2usize],
    #[doc = "< updated by samples, events"]
    pub last_status: UINT16,
    #[doc = "< number of items in queue"]
    pub queued_samples: UINT16,
    #[doc = "< includes control events"]
    pub queued_events: UINT16,
    #[doc = "< total queue buffer size"]
    pub queue_size: UINT16,
    #[doc = "< unused bytes in queue"]
    pub queue_free: UINT16,
    #[doc = "< time tracker last sent packet"]
    pub last_rcve_time: UINT32,
    #[doc = "< data type rcve enable (switch)"]
    pub samples_on: byte,
    pub events_on: byte,
    #[doc = "< status flags from data packet"]
    pub packet_flags: UINT16,
    #[doc = "< status flags from link packet header"]
    pub link_flags: UINT16,
    #[doc = "< tracker error state flags"]
    pub state_flags: UINT16,
    #[doc = "< tracker data output state"]
    pub link_dstatus: byte,
    #[doc = "< tracker commands pending"]
    pub link_pendcmd: byte,
    #[doc = "< 0 for EyeLink I or original EyeLink API DLL."]
    #[doc = "EYELINK II ONLY: MSB set if read"]
    #[doc = "crmode<<8 + file_filter<<4 + link_filter"]
    #[doc = "crmode = 0 if pupil, else pupil-CR"]
    #[doc = "file_filter, link_filter: 0, 1, or 2"]
    #[doc = "for level of heuristic filter applied"]
    pub reserved: UINT16,
    #[doc = "< a name for our machine"]
    pub our_name: [::std::os::raw::c_char; 40usize],
    pub our_address: ELINKADDR,
    #[doc = "< name of tracker connected to"]
    pub eye_name: [::std::os::raw::c_char; 40usize],
    pub eye_address: ELINKADDR,
    #[doc = "< Broadcast address for eye trackers"]
    pub ebroadcast_address: ELINKADDR,
    #[doc = "< Broadcast address for remotes"]
    pub rbroadcast_address: ELINKADDR,
    #[doc = "< 1 if polling remotes, else polling trackers"]
    pub polling_remotes: UINT16,
    #[doc = "< total nodes responding to polling"]
    pub poll_responses: UINT16,
    #[doc = "< data on nodes"]
    pub nodes: [ELINKNODE; 4usize],
}
#[test]
fn bindgen_test_layout_ILINKDATA() {
    assert_eq!(
        ::std::mem::size_of::<ILINKDATA>(),
        736usize,
        concat!("Size of: ", stringify!(ILINKDATA))
    );
    assert_eq!(
        ::std::mem::align_of::<ILINKDATA>(),
        4usize,
        concat!("Alignment of ", stringify!(ILINKDATA))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ILINKDATA>())).time as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ILINKDATA),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ILINKDATA>())).version as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ILINKDATA),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ILINKDATA>())).samrate as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ILINKDATA),
            "::",
            stringify!(samrate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ILINKDATA>())).samdiv as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(ILINKDATA),
            "::",
            stringify!(samdiv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ILINKDATA>())).prescaler as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ILINKDATA),
            "::",
            stringify!(prescaler)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ILINKDATA>())).vprescaler as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(ILINKDATA),
            "::",
            stringify!(vprescaler)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ILINKDATA>())).pprescaler as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ILINKDATA),
            "::",
            stringify!(pprescaler)
        )
    );
    assert_eq!(
